zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SPP_DMA5_TCD.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_spp_dma5_TCD.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_spp_dma5_TCD
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_spp_dma5_TCD_H_)  /* Check if memory map has not been already included */
#define S32K566_spp_dma5_TCD_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- spp_dma5_TCD Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup spp_dma5_TCD_Peripheral_Access_Layer spp_dma5_TCD Peripheral Access Layer
 * @{
 */

/** spp_dma5_TCD - Register Layout Typedef */
typedef struct spp_dma5_TCD_Struct {
  __IO uint32_t CH0_CSR;                           /**< Channel Control and Status, offset: 0x0 */
  __IO uint32_t CH0_ES;                            /**< Channel Error Status, offset: 0x4 */
  __IO uint32_t CH0_INT;                           /**< Channel Interrupt Status, offset: 0x8 */
  __I  uint32_t CH0_SBR;                           /**< Channel System Bus, offset: 0xC */
  __IO uint32_t CH0_PRI;                           /**< Channel Priority, offset: 0x10 */
  uint8_t RESERVED_0[4];
  __IO uint32_t CH0_MATTR;                         /**< Memory Attributes, offset: 0x18 */
  uint8_t RESERVED_1[4];
  __IO uint32_t TCD0_SADDR;                        /**< TCD Source Address, offset: 0x20 */
  __IO uint32_t TCD0_SADDR_HIGH;                   /**< TCD Source Address, offset: 0x24 */
  __IO uint16_t TCD0_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x28 */
  __IO uint16_t TCD0_ATTR;                         /**< TCD Transfer Attributes, offset: 0x2A */
  union {                                          /* offset: 0x2C */
    __IO uint32_t TCD0_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x2C */
    __IO uint32_t TCD0_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x2C */
  } NBYTES0;
  __IO uint32_t TCD0_SLAST_SDA;                    /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x30 */
  __IO uint32_t TCD0_SLAST_SDA_HIGH;               /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x34 */
  __IO uint32_t TCD0_DADDR;                        /**< TCD Destination Address, offset: 0x38 */
  __IO uint32_t TCD0_DADDR_HIGH;                   /**< TCD Destination Address, offset: 0x3C */
  __IO uint32_t TCD0_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x40 */
  __IO uint32_t TCD0_DLAST_SGA_HIGH;               /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x44 */
  __IO uint16_t TCD0_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x48 */
  union {                                          /* offset: 0x4A */
    __IO uint16_t TCD0_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x4A */
    __IO uint16_t TCD0_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x4A */
  } CITER0;
  __IO uint16_t TCD0_CSR;                          /**< TCD Control and Status, offset: 0x4C */
  union {                                          /* offset: 0x4E */
    __IO uint16_t TCD0_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x4E */
    __IO uint16_t TCD0_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x4E */
  } BITER0;
  uint8_t RESERVED_2[8112];
  __IO uint32_t CH1_CSR;                           /**< Channel Control and Status, offset: 0x2000 */
  __IO uint32_t CH1_ES;                            /**< Channel Error Status, offset: 0x2004 */
  __IO uint32_t CH1_INT;                           /**< Channel Interrupt Status, offset: 0x2008 */
  __I  uint32_t CH1_SBR;                           /**< Channel System Bus, offset: 0x200C */
  __IO uint32_t CH1_PRI;                           /**< Channel Priority, offset: 0x2010 */
  uint8_t RESERVED_3[4];
  __IO uint32_t CH1_MATTR;                         /**< Memory Attributes, offset: 0x2018 */
  uint8_t RESERVED_4[4];
  __IO uint32_t TCD1_SADDR;                        /**< TCD Source Address, offset: 0x2020 */
  __IO uint32_t TCD1_SADDR_HIGH;                   /**< TCD Source Address, offset: 0x2024 */
  __IO uint16_t TCD1_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x2028 */
  __IO uint16_t TCD1_ATTR;                         /**< TCD Transfer Attributes, offset: 0x202A */
  union {                                          /* offset: 0x202C */
    __IO uint32_t TCD1_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x202C */
    __IO uint32_t TCD1_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x202C */
  } NBYTES1;
  __IO uint32_t TCD1_SLAST_SDA;                    /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x2030 */
  __IO uint32_t TCD1_SLAST_SDA_HIGH;               /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x2034 */
  __IO uint32_t TCD1_DADDR;                        /**< TCD Destination Address, offset: 0x2038 */
  __IO uint32_t TCD1_DADDR_HIGH;                   /**< TCD Destination Address, offset: 0x203C */
  __IO uint32_t TCD1_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x2040 */
  __IO uint32_t TCD1_DLAST_SGA_HIGH;               /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x2044 */
  __IO uint16_t TCD1_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x2048 */
  union {                                          /* offset: 0x204A */
    __IO uint16_t TCD1_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x204A */
    __IO uint16_t TCD1_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x204A */
  } CITER1;
  __IO uint16_t TCD1_CSR;                          /**< TCD Control and Status, offset: 0x204C */
  union {                                          /* offset: 0x204E */
    __IO uint16_t TCD1_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x204E */
    __IO uint16_t TCD1_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x204E */
  } BITER1;
  uint8_t RESERVED_5[24496];
  __IO uint32_t CH2_CSR;                           /**< Channel Control and Status, offset: 0x8000 */
  __IO uint32_t CH2_ES;                            /**< Channel Error Status, offset: 0x8004 */
  __IO uint32_t CH2_INT;                           /**< Channel Interrupt Status, offset: 0x8008 */
  __I  uint32_t CH2_SBR;                           /**< Channel System Bus, offset: 0x800C */
  __IO uint32_t CH2_PRI;                           /**< Channel Priority, offset: 0x8010 */
  uint8_t RESERVED_6[4];
  __IO uint32_t CH2_MATTR;                         /**< Memory Attributes, offset: 0x8018 */
  uint8_t RESERVED_7[4];
  __IO uint32_t TCD2_SADDR;                        /**< TCD Source Address, offset: 0x8020 */
  __IO uint32_t TCD2_SADDR_HIGH;                   /**< TCD Source Address, offset: 0x8024 */
  __IO uint16_t TCD2_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x8028 */
  __IO uint16_t TCD2_ATTR;                         /**< TCD Transfer Attributes, offset: 0x802A */
  union {                                          /* offset: 0x802C */
    __IO uint32_t TCD2_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x802C */
    __IO uint32_t TCD2_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x802C */
  } NBYTES2;
  __IO uint32_t TCD2_SLAST_SDA;                    /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x8030 */
  __IO uint32_t TCD2_SLAST_SDA_HIGH;               /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x8034 */
  __IO uint32_t TCD2_DADDR;                        /**< TCD Destination Address, offset: 0x8038 */
  __IO uint32_t TCD2_DADDR_HIGH;                   /**< TCD Destination Address, offset: 0x803C */
  __IO uint32_t TCD2_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x8040 */
  __IO uint32_t TCD2_DLAST_SGA_HIGH;               /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x8044 */
  __IO uint16_t TCD2_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x8048 */
  union {                                          /* offset: 0x804A */
    __IO uint16_t TCD2_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x804A */
    __IO uint16_t TCD2_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x804A */
  } CITER2;
  __IO uint16_t TCD2_CSR;                          /**< TCD Control and Status, offset: 0x804C */
  union {                                          /* offset: 0x804E */
    __IO uint16_t TCD2_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x804E */
    __IO uint16_t TCD2_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x804E */
  } BITER2;
  uint8_t RESERVED_8[8112];
  __IO uint32_t CH3_CSR;                           /**< Channel Control and Status, offset: 0xA000 */
  __IO uint32_t CH3_ES;                            /**< Channel Error Status, offset: 0xA004 */
  __IO uint32_t CH3_INT;                           /**< Channel Interrupt Status, offset: 0xA008 */
  __I  uint32_t CH3_SBR;                           /**< Channel System Bus, offset: 0xA00C */
  __IO uint32_t CH3_PRI;                           /**< Channel Priority, offset: 0xA010 */
  uint8_t RESERVED_9[4];
  __IO uint32_t CH3_MATTR;                         /**< Memory Attributes, offset: 0xA018 */
  uint8_t RESERVED_10[4];
  __IO uint32_t TCD3_SADDR;                        /**< TCD Source Address, offset: 0xA020 */
  __IO uint32_t TCD3_SADDR_HIGH;                   /**< TCD Source Address, offset: 0xA024 */
  __IO uint16_t TCD3_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0xA028 */
  __IO uint16_t TCD3_ATTR;                         /**< TCD Transfer Attributes, offset: 0xA02A */
  union {                                          /* offset: 0xA02C */
    __IO uint32_t TCD3_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0xA02C */
    __IO uint32_t TCD3_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0xA02C */
  } NBYTES3;
  __IO uint32_t TCD3_SLAST_SDA;                    /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0xA030 */
  __IO uint32_t TCD3_SLAST_SDA_HIGH;               /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0xA034 */
  __IO uint32_t TCD3_DADDR;                        /**< TCD Destination Address, offset: 0xA038 */
  __IO uint32_t TCD3_DADDR_HIGH;                   /**< TCD Destination Address, offset: 0xA03C */
  __IO uint32_t TCD3_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0xA040 */
  __IO uint32_t TCD3_DLAST_SGA_HIGH;               /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0xA044 */
  __IO uint16_t TCD3_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0xA048 */
  union {                                          /* offset: 0xA04A */
    __IO uint16_t TCD3_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0xA04A */
    __IO uint16_t TCD3_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0xA04A */
  } CITER3;
  __IO uint16_t TCD3_CSR;                          /**< TCD Control and Status, offset: 0xA04C */
  union {                                          /* offset: 0xA04E */
    __IO uint16_t TCD3_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0xA04E */
    __IO uint16_t TCD3_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0xA04E */
  } BITER3;
  uint8_t RESERVED_11[24496];
  __IO uint32_t CH4_CSR;                           /**< Channel Control and Status, offset: 0x10000 */
  __IO uint32_t CH4_ES;                            /**< Channel Error Status, offset: 0x10004 */
  __IO uint32_t CH4_INT;                           /**< Channel Interrupt Status, offset: 0x10008 */
  __I  uint32_t CH4_SBR;                           /**< Channel System Bus, offset: 0x1000C */
  __IO uint32_t CH4_PRI;                           /**< Channel Priority, offset: 0x10010 */
  uint8_t RESERVED_12[4];
  __IO uint32_t CH4_MATTR;                         /**< Memory Attributes, offset: 0x10018 */
  uint8_t RESERVED_13[4];
  __IO uint32_t TCD4_SADDR;                        /**< TCD Source Address, offset: 0x10020 */
  __IO uint32_t TCD4_SADDR_HIGH;                   /**< TCD Source Address, offset: 0x10024 */
  __IO uint16_t TCD4_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x10028 */
  __IO uint16_t TCD4_ATTR;                         /**< TCD Transfer Attributes, offset: 0x1002A */
  union {                                          /* offset: 0x1002C */
    __IO uint32_t TCD4_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x1002C */
    __IO uint32_t TCD4_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x1002C */
  } NBYTES4;
  __IO uint32_t TCD4_SLAST_SDA;                    /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x10030 */
  __IO uint32_t TCD4_SLAST_SDA_HIGH;               /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x10034 */
  __IO uint32_t TCD4_DADDR;                        /**< TCD Destination Address, offset: 0x10038 */
  __IO uint32_t TCD4_DADDR_HIGH;                   /**< TCD Destination Address, offset: 0x1003C */
  __IO uint32_t TCD4_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x10040 */
  __IO uint32_t TCD4_DLAST_SGA_HIGH;               /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x10044 */
  __IO uint16_t TCD4_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x10048 */
  union {                                          /* offset: 0x1004A */
    __IO uint16_t TCD4_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x1004A */
    __IO uint16_t TCD4_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x1004A */
  } CITER4;
  __IO uint16_t TCD4_CSR;                          /**< TCD Control and Status, offset: 0x1004C */
  union {                                          /* offset: 0x1004E */
    __IO uint16_t TCD4_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x1004E */
    __IO uint16_t TCD4_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x1004E */
  } BITER4;
  uint8_t RESERVED_14[8112];
  __IO uint32_t CH5_CSR;                           /**< Channel Control and Status, offset: 0x12000 */
  __IO uint32_t CH5_ES;                            /**< Channel Error Status, offset: 0x12004 */
  __IO uint32_t CH5_INT;                           /**< Channel Interrupt Status, offset: 0x12008 */
  __I  uint32_t CH5_SBR;                           /**< Channel System Bus, offset: 0x1200C */
  __IO uint32_t CH5_PRI;                           /**< Channel Priority, offset: 0x12010 */
  uint8_t RESERVED_15[4];
  __IO uint32_t CH5_MATTR;                         /**< Memory Attributes, offset: 0x12018 */
  uint8_t RESERVED_16[4];
  __IO uint32_t TCD5_SADDR;                        /**< TCD Source Address, offset: 0x12020 */
  __IO uint32_t TCD5_SADDR_HIGH;                   /**< TCD Source Address, offset: 0x12024 */
  __IO uint16_t TCD5_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x12028 */
  __IO uint16_t TCD5_ATTR;                         /**< TCD Transfer Attributes, offset: 0x1202A */
  union {                                          /* offset: 0x1202C */
    __IO uint32_t TCD5_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x1202C */
    __IO uint32_t TCD5_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x1202C */
  } NBYTES5;
  __IO uint32_t TCD5_SLAST_SDA;                    /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x12030 */
  __IO uint32_t TCD5_SLAST_SDA_HIGH;               /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x12034 */
  __IO uint32_t TCD5_DADDR;                        /**< TCD Destination Address, offset: 0x12038 */
  __IO uint32_t TCD5_DADDR_HIGH;                   /**< TCD Destination Address, offset: 0x1203C */
  __IO uint32_t TCD5_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x12040 */
  __IO uint32_t TCD5_DLAST_SGA_HIGH;               /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x12044 */
  __IO uint16_t TCD5_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x12048 */
  union {                                          /* offset: 0x1204A */
    __IO uint16_t TCD5_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x1204A */
    __IO uint16_t TCD5_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x1204A */
  } CITER5;
  __IO uint16_t TCD5_CSR;                          /**< TCD Control and Status, offset: 0x1204C */
  union {                                          /* offset: 0x1204E */
    __IO uint16_t TCD5_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x1204E */
    __IO uint16_t TCD5_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x1204E */
  } BITER5;
  uint8_t RESERVED_17[24496];
  __IO uint32_t CH6_CSR;                           /**< Channel Control and Status, offset: 0x18000 */
  __IO uint32_t CH6_ES;                            /**< Channel Error Status, offset: 0x18004 */
  __IO uint32_t CH6_INT;                           /**< Channel Interrupt Status, offset: 0x18008 */
  __I  uint32_t CH6_SBR;                           /**< Channel System Bus, offset: 0x1800C */
  __IO uint32_t CH6_PRI;                           /**< Channel Priority, offset: 0x18010 */
  uint8_t RESERVED_18[4];
  __IO uint32_t CH6_MATTR;                         /**< Memory Attributes, offset: 0x18018 */
  uint8_t RESERVED_19[4];
  __IO uint32_t TCD6_SADDR;                        /**< TCD Source Address, offset: 0x18020 */
  __IO uint32_t TCD6_SADDR_HIGH;                   /**< TCD Source Address, offset: 0x18024 */
  __IO uint16_t TCD6_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x18028 */
  __IO uint16_t TCD6_ATTR;                         /**< TCD Transfer Attributes, offset: 0x1802A */
  union {                                          /* offset: 0x1802C */
    __IO uint32_t TCD6_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x1802C */
    __IO uint32_t TCD6_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x1802C */
  } NBYTES6;
  __IO uint32_t TCD6_SLAST_SDA;                    /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x18030 */
  __IO uint32_t TCD6_SLAST_SDA_HIGH;               /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x18034 */
  __IO uint32_t TCD6_DADDR;                        /**< TCD Destination Address, offset: 0x18038 */
  __IO uint32_t TCD6_DADDR_HIGH;                   /**< TCD Destination Address, offset: 0x1803C */
  __IO uint32_t TCD6_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x18040 */
  __IO uint32_t TCD6_DLAST_SGA_HIGH;               /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x18044 */
  __IO uint16_t TCD6_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x18048 */
  union {                                          /* offset: 0x1804A */
    __IO uint16_t TCD6_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x1804A */
    __IO uint16_t TCD6_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x1804A */
  } CITER6;
  __IO uint16_t TCD6_CSR;                          /**< TCD Control and Status, offset: 0x1804C */
  union {                                          /* offset: 0x1804E */
    __IO uint16_t TCD6_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x1804E */
    __IO uint16_t TCD6_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x1804E */
  } BITER6;
