zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SPP_DMA5_TCD.h
  uint8_t RESERVED_20[8112];
  __IO uint32_t CH7_CSR;                           /**< Channel Control and Status, offset: 0x1A000 */
  __IO uint32_t CH7_ES;                            /**< Channel Error Status, offset: 0x1A004 */
  __IO uint32_t CH7_INT;                           /**< Channel Interrupt Status, offset: 0x1A008 */
  __I  uint32_t CH7_SBR;                           /**< Channel System Bus, offset: 0x1A00C */
  __IO uint32_t CH7_PRI;                           /**< Channel Priority, offset: 0x1A010 */
  uint8_t RESERVED_21[4];
  __IO uint32_t CH7_MATTR;                         /**< Memory Attributes, offset: 0x1A018 */
  uint8_t RESERVED_22[4];
  __IO uint32_t TCD7_SADDR;                        /**< TCD Source Address, offset: 0x1A020 */
  __IO uint32_t TCD7_SADDR_HIGH;                   /**< TCD Source Address, offset: 0x1A024 */
  __IO uint16_t TCD7_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x1A028 */
  __IO uint16_t TCD7_ATTR;                         /**< TCD Transfer Attributes, offset: 0x1A02A */
  union {                                          /* offset: 0x1A02C */
    __IO uint32_t TCD7_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x1A02C */
    __IO uint32_t TCD7_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x1A02C */
  } NBYTES7;
  __IO uint32_t TCD7_SLAST_SDA;                    /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x1A030 */
  __IO uint32_t TCD7_SLAST_SDA_HIGH;               /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x1A034 */
  __IO uint32_t TCD7_DADDR;                        /**< TCD Destination Address, offset: 0x1A038 */
  __IO uint32_t TCD7_DADDR_HIGH;                   /**< TCD Destination Address, offset: 0x1A03C */
  __IO uint32_t TCD7_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x1A040 */
  __IO uint32_t TCD7_DLAST_SGA_HIGH;               /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x1A044 */
  __IO uint16_t TCD7_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x1A048 */
  union {                                          /* offset: 0x1A04A */
    __IO uint16_t TCD7_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x1A04A */
    __IO uint16_t TCD7_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x1A04A */
  } CITER7;
  __IO uint16_t TCD7_CSR;                          /**< TCD Control and Status, offset: 0x1A04C */
  union {                                          /* offset: 0x1A04E */
    __IO uint16_t TCD7_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x1A04E */
    __IO uint16_t TCD7_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x1A04E */
  } BITER7;
  uint8_t RESERVED_23[24496];
  __IO uint32_t CH8_CSR;                           /**< Channel Control and Status, offset: 0x20000 */
  __IO uint32_t CH8_ES;                            /**< Channel Error Status, offset: 0x20004 */
  __IO uint32_t CH8_INT;                           /**< Channel Interrupt Status, offset: 0x20008 */
  __I  uint32_t CH8_SBR;                           /**< Channel System Bus, offset: 0x2000C */
  __IO uint32_t CH8_PRI;                           /**< Channel Priority, offset: 0x20010 */
  uint8_t RESERVED_24[4];
  __IO uint32_t CH8_MATTR;                         /**< Memory Attributes, offset: 0x20018 */
  uint8_t RESERVED_25[4];
  __IO uint32_t TCD8_SADDR;                        /**< TCD Source Address, offset: 0x20020 */
  __IO uint32_t TCD8_SADDR_HIGH;                   /**< TCD Source Address, offset: 0x20024 */
  __IO uint16_t TCD8_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x20028 */
  __IO uint16_t TCD8_ATTR;                         /**< TCD Transfer Attributes, offset: 0x2002A */
  union {                                          /* offset: 0x2002C */
    __IO uint32_t TCD8_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x2002C */
    __IO uint32_t TCD8_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x2002C */
  } NBYTES8;
  __IO uint32_t TCD8_SLAST_SDA;                    /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x20030 */
  __IO uint32_t TCD8_SLAST_SDA_HIGH;               /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x20034 */
  __IO uint32_t TCD8_DADDR;                        /**< TCD Destination Address, offset: 0x20038 */
  __IO uint32_t TCD8_DADDR_HIGH;                   /**< TCD Destination Address, offset: 0x2003C */
  __IO uint32_t TCD8_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x20040 */
  __IO uint32_t TCD8_DLAST_SGA_HIGH;               /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x20044 */
  __IO uint16_t TCD8_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x20048 */
  union {                                          /* offset: 0x2004A */
    __IO uint16_t TCD8_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x2004A */
    __IO uint16_t TCD8_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x2004A */
  } CITER8;
  __IO uint16_t TCD8_CSR;                          /**< TCD Control and Status, offset: 0x2004C */
  union {                                          /* offset: 0x2004E */
    __IO uint16_t TCD8_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x2004E */
    __IO uint16_t TCD8_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x2004E */
  } BITER8;
  uint8_t RESERVED_26[8112];
  __IO uint32_t CH9_CSR;                           /**< Channel Control and Status, offset: 0x22000 */
  __IO uint32_t CH9_ES;                            /**< Channel Error Status, offset: 0x22004 */
  __IO uint32_t CH9_INT;                           /**< Channel Interrupt Status, offset: 0x22008 */
  __I  uint32_t CH9_SBR;                           /**< Channel System Bus, offset: 0x2200C */
  __IO uint32_t CH9_PRI;                           /**< Channel Priority, offset: 0x22010 */
  uint8_t RESERVED_27[4];
  __IO uint32_t CH9_MATTR;                         /**< Memory Attributes, offset: 0x22018 */
  uint8_t RESERVED_28[4];
  __IO uint32_t TCD9_SADDR;                        /**< TCD Source Address, offset: 0x22020 */
  __IO uint32_t TCD9_SADDR_HIGH;                   /**< TCD Source Address, offset: 0x22024 */
  __IO uint16_t TCD9_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x22028 */
  __IO uint16_t TCD9_ATTR;                         /**< TCD Transfer Attributes, offset: 0x2202A */
  union {                                          /* offset: 0x2202C */
    __IO uint32_t TCD9_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x2202C */
    __IO uint32_t TCD9_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x2202C */
  } NBYTES9;
  __IO uint32_t TCD9_SLAST_SDA;                    /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x22030 */
  __IO uint32_t TCD9_SLAST_SDA_HIGH;               /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x22034 */
  __IO uint32_t TCD9_DADDR;                        /**< TCD Destination Address, offset: 0x22038 */
  __IO uint32_t TCD9_DADDR_HIGH;                   /**< TCD Destination Address, offset: 0x2203C */
  __IO uint32_t TCD9_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x22040 */
  __IO uint32_t TCD9_DLAST_SGA_HIGH;               /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x22044 */
  __IO uint16_t TCD9_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x22048 */
  union {                                          /* offset: 0x2204A */
    __IO uint16_t TCD9_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x2204A */
    __IO uint16_t TCD9_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x2204A */
  } CITER9;
  __IO uint16_t TCD9_CSR;                          /**< TCD Control and Status, offset: 0x2204C */
  union {                                          /* offset: 0x2204E */
    __IO uint16_t TCD9_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x2204E */
    __IO uint16_t TCD9_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x2204E */
  } BITER9;
  uint8_t RESERVED_29[24496];
  __IO uint32_t CH10_CSR;                          /**< Channel Control and Status, offset: 0x28000 */
  __IO uint32_t CH10_ES;                           /**< Channel Error Status, offset: 0x28004 */
  __IO uint32_t CH10_INT;                          /**< Channel Interrupt Status, offset: 0x28008 */
  __I  uint32_t CH10_SBR;                          /**< Channel System Bus, offset: 0x2800C */
  __IO uint32_t CH10_PRI;                          /**< Channel Priority, offset: 0x28010 */
  uint8_t RESERVED_30[4];
  __IO uint32_t CH10_MATTR;                        /**< Memory Attributes, offset: 0x28018 */
  uint8_t RESERVED_31[4];
  __IO uint32_t TCD10_SADDR;                       /**< TCD Source Address, offset: 0x28020 */
  __IO uint32_t TCD10_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x28024 */
  __IO uint16_t TCD10_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x28028 */
  __IO uint16_t TCD10_ATTR;                        /**< TCD Transfer Attributes, offset: 0x2802A */
  union {                                          /* offset: 0x2802C */
    __IO uint32_t TCD10_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x2802C */
    __IO uint32_t TCD10_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x2802C */
  } NBYTES10;
  __IO uint32_t TCD10_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x28030 */
  __IO uint32_t TCD10_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x28034 */
  __IO uint32_t TCD10_DADDR;                       /**< TCD Destination Address, offset: 0x28038 */
  __IO uint32_t TCD10_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x2803C */
  __IO uint32_t TCD10_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x28040 */
  __IO uint32_t TCD10_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x28044 */
  __IO uint16_t TCD10_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x28048 */
  union {                                          /* offset: 0x2804A */
    __IO uint16_t TCD10_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x2804A */
    __IO uint16_t TCD10_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x2804A */
  } CITER10;
  __IO uint16_t TCD10_CSR;                         /**< TCD Control and Status, offset: 0x2804C */
  union {                                          /* offset: 0x2804E */
    __IO uint16_t TCD10_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x2804E */
    __IO uint16_t TCD10_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x2804E */
  } BITER10;
  uint8_t RESERVED_32[8112];
  __IO uint32_t CH11_CSR;                          /**< Channel Control and Status, offset: 0x2A000 */
  __IO uint32_t CH11_ES;                           /**< Channel Error Status, offset: 0x2A004 */
  __IO uint32_t CH11_INT;                          /**< Channel Interrupt Status, offset: 0x2A008 */
  __I  uint32_t CH11_SBR;                          /**< Channel System Bus, offset: 0x2A00C */
  __IO uint32_t CH11_PRI;                          /**< Channel Priority, offset: 0x2A010 */
  uint8_t RESERVED_33[4];
  __IO uint32_t CH11_MATTR;                        /**< Memory Attributes, offset: 0x2A018 */
  uint8_t RESERVED_34[4];
  __IO uint32_t TCD11_SADDR;                       /**< TCD Source Address, offset: 0x2A020 */
  __IO uint32_t TCD11_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x2A024 */
  __IO uint16_t TCD11_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x2A028 */
  __IO uint16_t TCD11_ATTR;                        /**< TCD Transfer Attributes, offset: 0x2A02A */
  union {                                          /* offset: 0x2A02C */
    __IO uint32_t TCD11_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x2A02C */
    __IO uint32_t TCD11_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x2A02C */
  } NBYTES11;
  __IO uint32_t TCD11_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x2A030 */
  __IO uint32_t TCD11_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x2A034 */
  __IO uint32_t TCD11_DADDR;                       /**< TCD Destination Address, offset: 0x2A038 */
  __IO uint32_t TCD11_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x2A03C */
  __IO uint32_t TCD11_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x2A040 */
  __IO uint32_t TCD11_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x2A044 */
  __IO uint16_t TCD11_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x2A048 */
  union {                                          /* offset: 0x2A04A */
    __IO uint16_t TCD11_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x2A04A */
    __IO uint16_t TCD11_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x2A04A */
  } CITER11;
  __IO uint16_t TCD11_CSR;                         /**< TCD Control and Status, offset: 0x2A04C */
  union {                                          /* offset: 0x2A04E */
    __IO uint16_t TCD11_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x2A04E */
    __IO uint16_t TCD11_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x2A04E */
  } BITER11;
  uint8_t RESERVED_35[24496];
  __IO uint32_t CH12_CSR;                          /**< Channel Control and Status, offset: 0x30000 */
  __IO uint32_t CH12_ES;                           /**< Channel Error Status, offset: 0x30004 */
  __IO uint32_t CH12_INT;                          /**< Channel Interrupt Status, offset: 0x30008 */
  __I  uint32_t CH12_SBR;                          /**< Channel System Bus, offset: 0x3000C */
  __IO uint32_t CH12_PRI;                          /**< Channel Priority, offset: 0x30010 */
  uint8_t RESERVED_36[4];
  __IO uint32_t CH12_MATTR;                        /**< Memory Attributes, offset: 0x30018 */
  uint8_t RESERVED_37[4];
  __IO uint32_t TCD12_SADDR;                       /**< TCD Source Address, offset: 0x30020 */
  __IO uint32_t TCD12_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x30024 */
  __IO uint16_t TCD12_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x30028 */
  __IO uint16_t TCD12_ATTR;                        /**< TCD Transfer Attributes, offset: 0x3002A */
  union {                                          /* offset: 0x3002C */
    __IO uint32_t TCD12_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x3002C */
    __IO uint32_t TCD12_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x3002C */
  } NBYTES12;
  __IO uint32_t TCD12_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x30030 */
  __IO uint32_t TCD12_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x30034 */
  __IO uint32_t TCD12_DADDR;                       /**< TCD Destination Address, offset: 0x30038 */
  __IO uint32_t TCD12_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x3003C */
  __IO uint32_t TCD12_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x30040 */
  __IO uint32_t TCD12_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x30044 */
  __IO uint16_t TCD12_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x30048 */
  union {                                          /* offset: 0x3004A */
    __IO uint16_t TCD12_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x3004A */
    __IO uint16_t TCD12_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x3004A */
  } CITER12;
  __IO uint16_t TCD12_CSR;                         /**< TCD Control and Status, offset: 0x3004C */
  union {                                          /* offset: 0x3004E */
    __IO uint16_t TCD12_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x3004E */
    __IO uint16_t TCD12_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x3004E */
  } BITER12;
  uint8_t RESERVED_38[8112];
  __IO uint32_t CH13_CSR;                          /**< Channel Control and Status, offset: 0x32000 */
  __IO uint32_t CH13_ES;                           /**< Channel Error Status, offset: 0x32004 */
  __IO uint32_t CH13_INT;                          /**< Channel Interrupt Status, offset: 0x32008 */
  __I  uint32_t CH13_SBR;                          /**< Channel System Bus, offset: 0x3200C */
  __IO uint32_t CH13_PRI;                          /**< Channel Priority, offset: 0x32010 */
  uint8_t RESERVED_39[4];
  __IO uint32_t CH13_MATTR;                        /**< Memory Attributes, offset: 0x32018 */
  uint8_t RESERVED_40[4];
  __IO uint32_t TCD13_SADDR;                       /**< TCD Source Address, offset: 0x32020 */
  __IO uint32_t TCD13_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x32024 */
  __IO uint16_t TCD13_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x32028 */
  __IO uint16_t TCD13_ATTR;                        /**< TCD Transfer Attributes, offset: 0x3202A */
  union {                                          /* offset: 0x3202C */
    __IO uint32_t TCD13_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x3202C */
    __IO uint32_t TCD13_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x3202C */
  } NBYTES13;
  __IO uint32_t TCD13_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x32030 */
  __IO uint32_t TCD13_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x32034 */
  __IO uint32_t TCD13_DADDR;                       /**< TCD Destination Address, offset: 0x32038 */
  __IO uint32_t TCD13_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x3203C */
  __IO uint32_t TCD13_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x32040 */
  __IO uint32_t TCD13_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x32044 */
  __IO uint16_t TCD13_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x32048 */
  union {                                          /* offset: 0x3204A */
    __IO uint16_t TCD13_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x3204A */
    __IO uint16_t TCD13_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x3204A */
  } CITER13;
  __IO uint16_t TCD13_CSR;                         /**< TCD Control and Status, offset: 0x3204C */
  union {                                          /* offset: 0x3204E */
    __IO uint16_t TCD13_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x3204E */
    __IO uint16_t TCD13_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x3204E */
  } BITER13;
  uint8_t RESERVED_41[24496];
  __IO uint32_t CH14_CSR;                          /**< Channel Control and Status, offset: 0x38000 */
  __IO uint32_t CH14_ES;                           /**< Channel Error Status, offset: 0x38004 */
  __IO uint32_t CH14_INT;                          /**< Channel Interrupt Status, offset: 0x38008 */
  __I  uint32_t CH14_SBR;                          /**< Channel System Bus, offset: 0x3800C */
  __IO uint32_t CH14_PRI;                          /**< Channel Priority, offset: 0x38010 */
  uint8_t RESERVED_42[4];
  __IO uint32_t CH14_MATTR;                        /**< Memory Attributes, offset: 0x38018 */
  uint8_t RESERVED_43[4];
  __IO uint32_t TCD14_SADDR;                       /**< TCD Source Address, offset: 0x38020 */
  __IO uint32_t TCD14_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x38024 */
  __IO uint16_t TCD14_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x38028 */
  __IO uint16_t TCD14_ATTR;                        /**< TCD Transfer Attributes, offset: 0x3802A */
  union {                                          /* offset: 0x3802C */
    __IO uint32_t TCD14_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x3802C */
    __IO uint32_t TCD14_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x3802C */
  } NBYTES14;
  __IO uint32_t TCD14_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x38030 */
  __IO uint32_t TCD14_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x38034 */
  __IO uint32_t TCD14_DADDR;                       /**< TCD Destination Address, offset: 0x38038 */
  __IO uint32_t TCD14_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x3803C */
  __IO uint32_t TCD14_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x38040 */
  __IO uint32_t TCD14_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x38044 */
