zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SPP_DMA5_TCD.h
  __IO uint16_t TCD14_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x38048 */
  union {                                          /* offset: 0x3804A */
    __IO uint16_t TCD14_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x3804A */
    __IO uint16_t TCD14_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x3804A */
  } CITER14;
  __IO uint16_t TCD14_CSR;                         /**< TCD Control and Status, offset: 0x3804C */
  union {                                          /* offset: 0x3804E */
    __IO uint16_t TCD14_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x3804E */
    __IO uint16_t TCD14_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x3804E */
  } BITER14;
  uint8_t RESERVED_44[8112];
  __IO uint32_t CH15_CSR;                          /**< Channel Control and Status, offset: 0x3A000 */
  __IO uint32_t CH15_ES;                           /**< Channel Error Status, offset: 0x3A004 */
  __IO uint32_t CH15_INT;                          /**< Channel Interrupt Status, offset: 0x3A008 */
  __I  uint32_t CH15_SBR;                          /**< Channel System Bus, offset: 0x3A00C */
  __IO uint32_t CH15_PRI;                          /**< Channel Priority, offset: 0x3A010 */
  uint8_t RESERVED_45[4];
  __IO uint32_t CH15_MATTR;                        /**< Memory Attributes, offset: 0x3A018 */
  uint8_t RESERVED_46[4];
  __IO uint32_t TCD15_SADDR;                       /**< TCD Source Address, offset: 0x3A020 */
  __IO uint32_t TCD15_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x3A024 */
  __IO uint16_t TCD15_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x3A028 */
  __IO uint16_t TCD15_ATTR;                        /**< TCD Transfer Attributes, offset: 0x3A02A */
  union {                                          /* offset: 0x3A02C */
    __IO uint32_t TCD15_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x3A02C */
    __IO uint32_t TCD15_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x3A02C */
  } NBYTES15;
  __IO uint32_t TCD15_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x3A030 */
  __IO uint32_t TCD15_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x3A034 */
  __IO uint32_t TCD15_DADDR;                       /**< TCD Destination Address, offset: 0x3A038 */
  __IO uint32_t TCD15_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x3A03C */
  __IO uint32_t TCD15_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x3A040 */
  __IO uint32_t TCD15_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x3A044 */
  __IO uint16_t TCD15_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x3A048 */
  union {                                          /* offset: 0x3A04A */
    __IO uint16_t TCD15_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x3A04A */
    __IO uint16_t TCD15_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x3A04A */
  } CITER15;
  __IO uint16_t TCD15_CSR;                         /**< TCD Control and Status, offset: 0x3A04C */
  union {                                          /* offset: 0x3A04E */
    __IO uint16_t TCD15_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x3A04E */
    __IO uint16_t TCD15_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x3A04E */
  } BITER15;
  uint8_t RESERVED_47[6102960];
  __IO uint32_t CH16_CSR;                          /**< Channel Control and Status, offset: 0x60C000 */
  __IO uint32_t CH16_ES;                           /**< Channel Error Status, offset: 0x60C004 */
  __IO uint32_t CH16_INT;                          /**< Channel Interrupt Status, offset: 0x60C008 */
  __I  uint32_t CH16_SBR;                          /**< Channel System Bus, offset: 0x60C00C */
  __IO uint32_t CH16_PRI;                          /**< Channel Priority, offset: 0x60C010 */
  uint8_t RESERVED_48[4];
  __IO uint32_t CH16_MATTR;                        /**< Memory Attributes, offset: 0x60C018 */
  uint8_t RESERVED_49[4];
  __IO uint32_t TCD16_SADDR;                       /**< TCD Source Address, offset: 0x60C020 */
  __IO uint32_t TCD16_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x60C024 */
  __IO uint16_t TCD16_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x60C028 */
  __IO uint16_t TCD16_ATTR;                        /**< TCD Transfer Attributes, offset: 0x60C02A */
  union {                                          /* offset: 0x60C02C */
    __IO uint32_t TCD16_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x60C02C */
    __IO uint32_t TCD16_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x60C02C */
  } NBYTES16;
  __IO uint32_t TCD16_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x60C030 */
  __IO uint32_t TCD16_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x60C034 */
  __IO uint32_t TCD16_DADDR;                       /**< TCD Destination Address, offset: 0x60C038 */
  __IO uint32_t TCD16_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x60C03C */
  __IO uint32_t TCD16_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x60C040 */
  __IO uint32_t TCD16_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x60C044 */
  __IO uint16_t TCD16_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x60C048 */
  union {                                          /* offset: 0x60C04A */
    __IO uint16_t TCD16_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x60C04A */
    __IO uint16_t TCD16_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x60C04A */
  } CITER16;
  __IO uint16_t TCD16_CSR;                         /**< TCD Control and Status, offset: 0x60C04C */
  union {                                          /* offset: 0x60C04E */
    __IO uint16_t TCD16_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x60C04E */
    __IO uint16_t TCD16_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x60C04E */
  } BITER16;
  uint8_t RESERVED_50[8112];
  __IO uint32_t CH17_CSR;                          /**< Channel Control and Status, offset: 0x60E000 */
  __IO uint32_t CH17_ES;                           /**< Channel Error Status, offset: 0x60E004 */
  __IO uint32_t CH17_INT;                          /**< Channel Interrupt Status, offset: 0x60E008 */
  __I  uint32_t CH17_SBR;                          /**< Channel System Bus, offset: 0x60E00C */
  __IO uint32_t CH17_PRI;                          /**< Channel Priority, offset: 0x60E010 */
  uint8_t RESERVED_51[4];
  __IO uint32_t CH17_MATTR;                        /**< Memory Attributes, offset: 0x60E018 */
  uint8_t RESERVED_52[4];
  __IO uint32_t TCD17_SADDR;                       /**< TCD Source Address, offset: 0x60E020 */
  __IO uint32_t TCD17_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x60E024 */
  __IO uint16_t TCD17_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x60E028 */
  __IO uint16_t TCD17_ATTR;                        /**< TCD Transfer Attributes, offset: 0x60E02A */
  union {                                          /* offset: 0x60E02C */
    __IO uint32_t TCD17_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x60E02C */
    __IO uint32_t TCD17_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x60E02C */
  } NBYTES17;
  __IO uint32_t TCD17_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x60E030 */
  __IO uint32_t TCD17_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x60E034 */
  __IO uint32_t TCD17_DADDR;                       /**< TCD Destination Address, offset: 0x60E038 */
  __IO uint32_t TCD17_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x60E03C */
  __IO uint32_t TCD17_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x60E040 */
  __IO uint32_t TCD17_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x60E044 */
  __IO uint16_t TCD17_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x60E048 */
  union {                                          /* offset: 0x60E04A */
    __IO uint16_t TCD17_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x60E04A */
    __IO uint16_t TCD17_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x60E04A */
  } CITER17;
  __IO uint16_t TCD17_CSR;                         /**< TCD Control and Status, offset: 0x60E04C */
  union {                                          /* offset: 0x60E04E */
    __IO uint16_t TCD17_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x60E04E */
    __IO uint16_t TCD17_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x60E04E */
  } BITER17;
  uint8_t RESERVED_53[24496];
  __IO uint32_t CH18_CSR;                          /**< Channel Control and Status, offset: 0x614000 */
  __IO uint32_t CH18_ES;                           /**< Channel Error Status, offset: 0x614004 */
  __IO uint32_t CH18_INT;                          /**< Channel Interrupt Status, offset: 0x614008 */
  __I  uint32_t CH18_SBR;                          /**< Channel System Bus, offset: 0x61400C */
  __IO uint32_t CH18_PRI;                          /**< Channel Priority, offset: 0x614010 */
  uint8_t RESERVED_54[4];
  __IO uint32_t CH18_MATTR;                        /**< Memory Attributes, offset: 0x614018 */
  uint8_t RESERVED_55[4];
  __IO uint32_t TCD18_SADDR;                       /**< TCD Source Address, offset: 0x614020 */
  __IO uint32_t TCD18_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x614024 */
  __IO uint16_t TCD18_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x614028 */
  __IO uint16_t TCD18_ATTR;                        /**< TCD Transfer Attributes, offset: 0x61402A */
  union {                                          /* offset: 0x61402C */
    __IO uint32_t TCD18_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x61402C */
    __IO uint32_t TCD18_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x61402C */
  } NBYTES18;
  __IO uint32_t TCD18_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x614030 */
  __IO uint32_t TCD18_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x614034 */
  __IO uint32_t TCD18_DADDR;                       /**< TCD Destination Address, offset: 0x614038 */
  __IO uint32_t TCD18_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x61403C */
  __IO uint32_t TCD18_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x614040 */
  __IO uint32_t TCD18_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x614044 */
  __IO uint16_t TCD18_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x614048 */
  union {                                          /* offset: 0x61404A */
    __IO uint16_t TCD18_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x61404A */
    __IO uint16_t TCD18_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x61404A */
  } CITER18;
  __IO uint16_t TCD18_CSR;                         /**< TCD Control and Status, offset: 0x61404C */
  union {                                          /* offset: 0x61404E */
    __IO uint16_t TCD18_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x61404E */
    __IO uint16_t TCD18_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x61404E */
  } BITER18;
  uint8_t RESERVED_56[8112];
  __IO uint32_t CH19_CSR;                          /**< Channel Control and Status, offset: 0x616000 */
  __IO uint32_t CH19_ES;                           /**< Channel Error Status, offset: 0x616004 */
  __IO uint32_t CH19_INT;                          /**< Channel Interrupt Status, offset: 0x616008 */
  __I  uint32_t CH19_SBR;                          /**< Channel System Bus, offset: 0x61600C */
  __IO uint32_t CH19_PRI;                          /**< Channel Priority, offset: 0x616010 */
  uint8_t RESERVED_57[4];
  __IO uint32_t CH19_MATTR;                        /**< Memory Attributes, offset: 0x616018 */
  uint8_t RESERVED_58[4];
  __IO uint32_t TCD19_SADDR;                       /**< TCD Source Address, offset: 0x616020 */
  __IO uint32_t TCD19_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x616024 */
  __IO uint16_t TCD19_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x616028 */
  __IO uint16_t TCD19_ATTR;                        /**< TCD Transfer Attributes, offset: 0x61602A */
  union {                                          /* offset: 0x61602C */
    __IO uint32_t TCD19_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x61602C */
    __IO uint32_t TCD19_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x61602C */
  } NBYTES19;
  __IO uint32_t TCD19_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x616030 */
  __IO uint32_t TCD19_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x616034 */
  __IO uint32_t TCD19_DADDR;                       /**< TCD Destination Address, offset: 0x616038 */
  __IO uint32_t TCD19_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x61603C */
  __IO uint32_t TCD19_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x616040 */
  __IO uint32_t TCD19_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x616044 */
  __IO uint16_t TCD19_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x616048 */
  union {                                          /* offset: 0x61604A */
    __IO uint16_t TCD19_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x61604A */
    __IO uint16_t TCD19_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x61604A */
  } CITER19;
  __IO uint16_t TCD19_CSR;                         /**< TCD Control and Status, offset: 0x61604C */
  union {                                          /* offset: 0x61604E */
    __IO uint16_t TCD19_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x61604E */
    __IO uint16_t TCD19_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x61604E */
  } BITER19;
  uint8_t RESERVED_59[24496];
  __IO uint32_t CH20_CSR;                          /**< Channel Control and Status, offset: 0x61C000 */
  __IO uint32_t CH20_ES;                           /**< Channel Error Status, offset: 0x61C004 */
  __IO uint32_t CH20_INT;                          /**< Channel Interrupt Status, offset: 0x61C008 */
  __I  uint32_t CH20_SBR;                          /**< Channel System Bus, offset: 0x61C00C */
  __IO uint32_t CH20_PRI;                          /**< Channel Priority, offset: 0x61C010 */
  uint8_t RESERVED_60[4];
  __IO uint32_t CH20_MATTR;                        /**< Memory Attributes, offset: 0x61C018 */
  uint8_t RESERVED_61[4];
  __IO uint32_t TCD20_SADDR;                       /**< TCD Source Address, offset: 0x61C020 */
  __IO uint32_t TCD20_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x61C024 */
  __IO uint16_t TCD20_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x61C028 */
  __IO uint16_t TCD20_ATTR;                        /**< TCD Transfer Attributes, offset: 0x61C02A */
  union {                                          /* offset: 0x61C02C */
    __IO uint32_t TCD20_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x61C02C */
    __IO uint32_t TCD20_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x61C02C */
  } NBYTES20;
  __IO uint32_t TCD20_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x61C030 */
  __IO uint32_t TCD20_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x61C034 */
  __IO uint32_t TCD20_DADDR;                       /**< TCD Destination Address, offset: 0x61C038 */
  __IO uint32_t TCD20_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x61C03C */
  __IO uint32_t TCD20_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x61C040 */
  __IO uint32_t TCD20_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x61C044 */
  __IO uint16_t TCD20_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x61C048 */
  union {                                          /* offset: 0x61C04A */
    __IO uint16_t TCD20_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x61C04A */
    __IO uint16_t TCD20_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x61C04A */
  } CITER20;
  __IO uint16_t TCD20_CSR;                         /**< TCD Control and Status, offset: 0x61C04C */
  union {                                          /* offset: 0x61C04E */
    __IO uint16_t TCD20_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x61C04E */
    __IO uint16_t TCD20_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x61C04E */
  } BITER20;
  uint8_t RESERVED_62[8112];
  __IO uint32_t CH21_CSR;                          /**< Channel Control and Status, offset: 0x61E000 */
  __IO uint32_t CH21_ES;                           /**< Channel Error Status, offset: 0x61E004 */
  __IO uint32_t CH21_INT;                          /**< Channel Interrupt Status, offset: 0x61E008 */
  __I  uint32_t CH21_SBR;                          /**< Channel System Bus, offset: 0x61E00C */
  __IO uint32_t CH21_PRI;                          /**< Channel Priority, offset: 0x61E010 */
  uint8_t RESERVED_63[4];
  __IO uint32_t CH21_MATTR;                        /**< Memory Attributes, offset: 0x61E018 */
  uint8_t RESERVED_64[4];
  __IO uint32_t TCD21_SADDR;                       /**< TCD Source Address, offset: 0x61E020 */
  __IO uint32_t TCD21_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x61E024 */
  __IO uint16_t TCD21_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x61E028 */
  __IO uint16_t TCD21_ATTR;                        /**< TCD Transfer Attributes, offset: 0x61E02A */
  union {                                          /* offset: 0x61E02C */
    __IO uint32_t TCD21_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x61E02C */
    __IO uint32_t TCD21_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x61E02C */
  } NBYTES21;
  __IO uint32_t TCD21_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x61E030 */
  __IO uint32_t TCD21_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x61E034 */
  __IO uint32_t TCD21_DADDR;                       /**< TCD Destination Address, offset: 0x61E038 */
  __IO uint32_t TCD21_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x61E03C */
  __IO uint32_t TCD21_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x61E040 */
  __IO uint32_t TCD21_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x61E044 */
  __IO uint16_t TCD21_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x61E048 */
  union {                                          /* offset: 0x61E04A */
    __IO uint16_t TCD21_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x61E04A */
    __IO uint16_t TCD21_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x61E04A */
  } CITER21;
  __IO uint16_t TCD21_CSR;                         /**< TCD Control and Status, offset: 0x61E04C */
  union {                                          /* offset: 0x61E04E */
    __IO uint16_t TCD21_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x61E04E */
    __IO uint16_t TCD21_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x61E04E */
  } BITER21;
  uint8_t RESERVED_65[24496];
  __IO uint32_t CH22_CSR;                          /**< Channel Control and Status, offset: 0x624000 */
  __IO uint32_t CH22_ES;                           /**< Channel Error Status, offset: 0x624004 */
  __IO uint32_t CH22_INT;                          /**< Channel Interrupt Status, offset: 0x624008 */
  __I  uint32_t CH22_SBR;                          /**< Channel System Bus, offset: 0x62400C */
  __IO uint32_t CH22_PRI;                          /**< Channel Priority, offset: 0x624010 */
  uint8_t RESERVED_66[4];
  __IO uint32_t CH22_MATTR;                        /**< Memory Attributes, offset: 0x624018 */
  uint8_t RESERVED_67[4];
  __IO uint32_t TCD22_SADDR;                       /**< TCD Source Address, offset: 0x624020 */
  __IO uint32_t TCD22_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x624024 */
  __IO uint16_t TCD22_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x624028 */
