zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SPP_DMA5_TCD.h
  __IO uint16_t TCD22_ATTR;                        /**< TCD Transfer Attributes, offset: 0x62402A */
  union {                                          /* offset: 0x62402C */
    __IO uint32_t TCD22_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x62402C */
    __IO uint32_t TCD22_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x62402C */
  } NBYTES22;
  __IO uint32_t TCD22_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x624030 */
  __IO uint32_t TCD22_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x624034 */
  __IO uint32_t TCD22_DADDR;                       /**< TCD Destination Address, offset: 0x624038 */
  __IO uint32_t TCD22_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x62403C */
  __IO uint32_t TCD22_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x624040 */
  __IO uint32_t TCD22_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x624044 */
  __IO uint16_t TCD22_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x624048 */
  union {                                          /* offset: 0x62404A */
    __IO uint16_t TCD22_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x62404A */
    __IO uint16_t TCD22_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x62404A */
  } CITER22;
  __IO uint16_t TCD22_CSR;                         /**< TCD Control and Status, offset: 0x62404C */
  union {                                          /* offset: 0x62404E */
    __IO uint16_t TCD22_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x62404E */
    __IO uint16_t TCD22_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x62404E */
  } BITER22;
  uint8_t RESERVED_68[8112];
  __IO uint32_t CH23_CSR;                          /**< Channel Control and Status, offset: 0x626000 */
  __IO uint32_t CH23_ES;                           /**< Channel Error Status, offset: 0x626004 */
  __IO uint32_t CH23_INT;                          /**< Channel Interrupt Status, offset: 0x626008 */
  __I  uint32_t CH23_SBR;                          /**< Channel System Bus, offset: 0x62600C */
  __IO uint32_t CH23_PRI;                          /**< Channel Priority, offset: 0x626010 */
  uint8_t RESERVED_69[4];
  __IO uint32_t CH23_MATTR;                        /**< Memory Attributes, offset: 0x626018 */
  uint8_t RESERVED_70[4];
  __IO uint32_t TCD23_SADDR;                       /**< TCD Source Address, offset: 0x626020 */
  __IO uint32_t TCD23_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x626024 */
  __IO uint16_t TCD23_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x626028 */
  __IO uint16_t TCD23_ATTR;                        /**< TCD Transfer Attributes, offset: 0x62602A */
  union {                                          /* offset: 0x62602C */
    __IO uint32_t TCD23_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x62602C */
    __IO uint32_t TCD23_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x62602C */
  } NBYTES23;
  __IO uint32_t TCD23_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x626030 */
  __IO uint32_t TCD23_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x626034 */
  __IO uint32_t TCD23_DADDR;                       /**< TCD Destination Address, offset: 0x626038 */
  __IO uint32_t TCD23_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x62603C */
  __IO uint32_t TCD23_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x626040 */
  __IO uint32_t TCD23_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x626044 */
  __IO uint16_t TCD23_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x626048 */
  union {                                          /* offset: 0x62604A */
    __IO uint16_t TCD23_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x62604A */
    __IO uint16_t TCD23_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x62604A */
  } CITER23;
  __IO uint16_t TCD23_CSR;                         /**< TCD Control and Status, offset: 0x62604C */
  union {                                          /* offset: 0x62604E */
    __IO uint16_t TCD23_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x62604E */
    __IO uint16_t TCD23_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x62604E */
  } BITER23;
  uint8_t RESERVED_71[24496];
  __IO uint32_t CH24_CSR;                          /**< Channel Control and Status, offset: 0x62C000 */
  __IO uint32_t CH24_ES;                           /**< Channel Error Status, offset: 0x62C004 */
  __IO uint32_t CH24_INT;                          /**< Channel Interrupt Status, offset: 0x62C008 */
  __I  uint32_t CH24_SBR;                          /**< Channel System Bus, offset: 0x62C00C */
  __IO uint32_t CH24_PRI;                          /**< Channel Priority, offset: 0x62C010 */
  uint8_t RESERVED_72[4];
  __IO uint32_t CH24_MATTR;                        /**< Memory Attributes, offset: 0x62C018 */
  uint8_t RESERVED_73[4];
  __IO uint32_t TCD24_SADDR;                       /**< TCD Source Address, offset: 0x62C020 */
  __IO uint32_t TCD24_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x62C024 */
  __IO uint16_t TCD24_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x62C028 */
  __IO uint16_t TCD24_ATTR;                        /**< TCD Transfer Attributes, offset: 0x62C02A */
  union {                                          /* offset: 0x62C02C */
    __IO uint32_t TCD24_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x62C02C */
    __IO uint32_t TCD24_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x62C02C */
  } NBYTES24;
  __IO uint32_t TCD24_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x62C030 */
  __IO uint32_t TCD24_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x62C034 */
  __IO uint32_t TCD24_DADDR;                       /**< TCD Destination Address, offset: 0x62C038 */
  __IO uint32_t TCD24_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x62C03C */
  __IO uint32_t TCD24_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x62C040 */
  __IO uint32_t TCD24_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x62C044 */
  __IO uint16_t TCD24_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x62C048 */
  union {                                          /* offset: 0x62C04A */
    __IO uint16_t TCD24_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x62C04A */
    __IO uint16_t TCD24_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x62C04A */
  } CITER24;
  __IO uint16_t TCD24_CSR;                         /**< TCD Control and Status, offset: 0x62C04C */
  union {                                          /* offset: 0x62C04E */
    __IO uint16_t TCD24_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x62C04E */
    __IO uint16_t TCD24_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x62C04E */
  } BITER24;
  uint8_t RESERVED_74[8112];
  __IO uint32_t CH25_CSR;                          /**< Channel Control and Status, offset: 0x62E000 */
  __IO uint32_t CH25_ES;                           /**< Channel Error Status, offset: 0x62E004 */
  __IO uint32_t CH25_INT;                          /**< Channel Interrupt Status, offset: 0x62E008 */
  __I  uint32_t CH25_SBR;                          /**< Channel System Bus, offset: 0x62E00C */
  __IO uint32_t CH25_PRI;                          /**< Channel Priority, offset: 0x62E010 */
  uint8_t RESERVED_75[4];
  __IO uint32_t CH25_MATTR;                        /**< Memory Attributes, offset: 0x62E018 */
  uint8_t RESERVED_76[4];
  __IO uint32_t TCD25_SADDR;                       /**< TCD Source Address, offset: 0x62E020 */
  __IO uint32_t TCD25_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x62E024 */
  __IO uint16_t TCD25_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x62E028 */
  __IO uint16_t TCD25_ATTR;                        /**< TCD Transfer Attributes, offset: 0x62E02A */
  union {                                          /* offset: 0x62E02C */
    __IO uint32_t TCD25_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x62E02C */
    __IO uint32_t TCD25_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x62E02C */
  } NBYTES25;
  __IO uint32_t TCD25_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x62E030 */
  __IO uint32_t TCD25_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x62E034 */
  __IO uint32_t TCD25_DADDR;                       /**< TCD Destination Address, offset: 0x62E038 */
  __IO uint32_t TCD25_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x62E03C */
  __IO uint32_t TCD25_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x62E040 */
  __IO uint32_t TCD25_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x62E044 */
  __IO uint16_t TCD25_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x62E048 */
  union {                                          /* offset: 0x62E04A */
    __IO uint16_t TCD25_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x62E04A */
    __IO uint16_t TCD25_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x62E04A */
  } CITER25;
  __IO uint16_t TCD25_CSR;                         /**< TCD Control and Status, offset: 0x62E04C */
  union {                                          /* offset: 0x62E04E */
    __IO uint16_t TCD25_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x62E04E */
    __IO uint16_t TCD25_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x62E04E */
  } BITER25;
  uint8_t RESERVED_77[24496];
  __IO uint32_t CH26_CSR;                          /**< Channel Control and Status, offset: 0x634000 */
  __IO uint32_t CH26_ES;                           /**< Channel Error Status, offset: 0x634004 */
  __IO uint32_t CH26_INT;                          /**< Channel Interrupt Status, offset: 0x634008 */
  __I  uint32_t CH26_SBR;                          /**< Channel System Bus, offset: 0x63400C */
  __IO uint32_t CH26_PRI;                          /**< Channel Priority, offset: 0x634010 */
  uint8_t RESERVED_78[4];
  __IO uint32_t CH26_MATTR;                        /**< Memory Attributes, offset: 0x634018 */
  uint8_t RESERVED_79[4];
  __IO uint32_t TCD26_SADDR;                       /**< TCD Source Address, offset: 0x634020 */
  __IO uint32_t TCD26_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x634024 */
  __IO uint16_t TCD26_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x634028 */
  __IO uint16_t TCD26_ATTR;                        /**< TCD Transfer Attributes, offset: 0x63402A */
  union {                                          /* offset: 0x63402C */
    __IO uint32_t TCD26_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x63402C */
    __IO uint32_t TCD26_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x63402C */
  } NBYTES26;
  __IO uint32_t TCD26_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x634030 */
  __IO uint32_t TCD26_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x634034 */
  __IO uint32_t TCD26_DADDR;                       /**< TCD Destination Address, offset: 0x634038 */
  __IO uint32_t TCD26_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x63403C */
  __IO uint32_t TCD26_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x634040 */
  __IO uint32_t TCD26_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x634044 */
  __IO uint16_t TCD26_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x634048 */
  union {                                          /* offset: 0x63404A */
    __IO uint16_t TCD26_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x63404A */
    __IO uint16_t TCD26_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x63404A */
  } CITER26;
  __IO uint16_t TCD26_CSR;                         /**< TCD Control and Status, offset: 0x63404C */
  union {                                          /* offset: 0x63404E */
    __IO uint16_t TCD26_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x63404E */
    __IO uint16_t TCD26_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x63404E */
  } BITER26;
  uint8_t RESERVED_80[8112];
  __IO uint32_t CH27_CSR;                          /**< Channel Control and Status, offset: 0x636000 */
  __IO uint32_t CH27_ES;                           /**< Channel Error Status, offset: 0x636004 */
  __IO uint32_t CH27_INT;                          /**< Channel Interrupt Status, offset: 0x636008 */
  __I  uint32_t CH27_SBR;                          /**< Channel System Bus, offset: 0x63600C */
  __IO uint32_t CH27_PRI;                          /**< Channel Priority, offset: 0x636010 */
  uint8_t RESERVED_81[4];
  __IO uint32_t CH27_MATTR;                        /**< Memory Attributes, offset: 0x636018 */
  uint8_t RESERVED_82[4];
  __IO uint32_t TCD27_SADDR;                       /**< TCD Source Address, offset: 0x636020 */
  __IO uint32_t TCD27_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x636024 */
  __IO uint16_t TCD27_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x636028 */
  __IO uint16_t TCD27_ATTR;                        /**< TCD Transfer Attributes, offset: 0x63602A */
  union {                                          /* offset: 0x63602C */
    __IO uint32_t TCD27_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x63602C */
    __IO uint32_t TCD27_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x63602C */
  } NBYTES27;
  __IO uint32_t TCD27_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x636030 */
  __IO uint32_t TCD27_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x636034 */
  __IO uint32_t TCD27_DADDR;                       /**< TCD Destination Address, offset: 0x636038 */
  __IO uint32_t TCD27_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x63603C */
  __IO uint32_t TCD27_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x636040 */
  __IO uint32_t TCD27_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x636044 */
  __IO uint16_t TCD27_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x636048 */
  union {                                          /* offset: 0x63604A */
    __IO uint16_t TCD27_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x63604A */
    __IO uint16_t TCD27_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x63604A */
  } CITER27;
  __IO uint16_t TCD27_CSR;                         /**< TCD Control and Status, offset: 0x63604C */
  union {                                          /* offset: 0x63604E */
    __IO uint16_t TCD27_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x63604E */
    __IO uint16_t TCD27_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x63604E */
  } BITER27;
  uint8_t RESERVED_83[24496];
  __IO uint32_t CH28_CSR;                          /**< Channel Control and Status, offset: 0x63C000 */
  __IO uint32_t CH28_ES;                           /**< Channel Error Status, offset: 0x63C004 */
  __IO uint32_t CH28_INT;                          /**< Channel Interrupt Status, offset: 0x63C008 */
  __I  uint32_t CH28_SBR;                          /**< Channel System Bus, offset: 0x63C00C */
  __IO uint32_t CH28_PRI;                          /**< Channel Priority, offset: 0x63C010 */
  uint8_t RESERVED_84[4];
  __IO uint32_t CH28_MATTR;                        /**< Memory Attributes, offset: 0x63C018 */
  uint8_t RESERVED_85[4];
  __IO uint32_t TCD28_SADDR;                       /**< TCD Source Address, offset: 0x63C020 */
  __IO uint32_t TCD28_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x63C024 */
  __IO uint16_t TCD28_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x63C028 */
  __IO uint16_t TCD28_ATTR;                        /**< TCD Transfer Attributes, offset: 0x63C02A */
  union {                                          /* offset: 0x63C02C */
    __IO uint32_t TCD28_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x63C02C */
    __IO uint32_t TCD28_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x63C02C */
  } NBYTES28;
  __IO uint32_t TCD28_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x63C030 */
  __IO uint32_t TCD28_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x63C034 */
  __IO uint32_t TCD28_DADDR;                       /**< TCD Destination Address, offset: 0x63C038 */
  __IO uint32_t TCD28_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x63C03C */
  __IO uint32_t TCD28_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x63C040 */
  __IO uint32_t TCD28_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x63C044 */
  __IO uint16_t TCD28_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x63C048 */
  union {                                          /* offset: 0x63C04A */
    __IO uint16_t TCD28_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x63C04A */
    __IO uint16_t TCD28_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x63C04A */
  } CITER28;
  __IO uint16_t TCD28_CSR;                         /**< TCD Control and Status, offset: 0x63C04C */
  union {                                          /* offset: 0x63C04E */
    __IO uint16_t TCD28_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x63C04E */
    __IO uint16_t TCD28_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x63C04E */
  } BITER28;
  uint8_t RESERVED_86[8112];
  __IO uint32_t CH29_CSR;                          /**< Channel Control and Status, offset: 0x63E000 */
  __IO uint32_t CH29_ES;                           /**< Channel Error Status, offset: 0x63E004 */
  __IO uint32_t CH29_INT;                          /**< Channel Interrupt Status, offset: 0x63E008 */
  __I  uint32_t CH29_SBR;                          /**< Channel System Bus, offset: 0x63E00C */
  __IO uint32_t CH29_PRI;                          /**< Channel Priority, offset: 0x63E010 */
  uint8_t RESERVED_87[4];
  __IO uint32_t CH29_MATTR;                        /**< Memory Attributes, offset: 0x63E018 */
  uint8_t RESERVED_88[4];
  __IO uint32_t TCD29_SADDR;                       /**< TCD Source Address, offset: 0x63E020 */
  __IO uint32_t TCD29_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x63E024 */
  __IO uint16_t TCD29_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x63E028 */
  __IO uint16_t TCD29_ATTR;                        /**< TCD Transfer Attributes, offset: 0x63E02A */
  union {                                          /* offset: 0x63E02C */
    __IO uint32_t TCD29_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x63E02C */
    __IO uint32_t TCD29_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x63E02C */
  } NBYTES29;
  __IO uint32_t TCD29_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x63E030 */
  __IO uint32_t TCD29_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x63E034 */
  __IO uint32_t TCD29_DADDR;                       /**< TCD Destination Address, offset: 0x63E038 */
  __IO uint32_t TCD29_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x63E03C */
  __IO uint32_t TCD29_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x63E040 */
  __IO uint32_t TCD29_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x63E044 */
  __IO uint16_t TCD29_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x63E048 */
  union {                                          /* offset: 0x63E04A */
    __IO uint16_t TCD29_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x63E04A */
    __IO uint16_t TCD29_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x63E04A */
  } CITER29;
  __IO uint16_t TCD29_CSR;                         /**< TCD Control and Status, offset: 0x63E04C */
  union {                                          /* offset: 0x63E04E */
