zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SPP_DMA5_TCD.h
    __IO uint16_t TCD29_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x63E04E */
    __IO uint16_t TCD29_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x63E04E */
  } BITER29;
  uint8_t RESERVED_89[24496];
  __IO uint32_t CH30_CSR;                          /**< Channel Control and Status, offset: 0x644000 */
  __IO uint32_t CH30_ES;                           /**< Channel Error Status, offset: 0x644004 */
  __IO uint32_t CH30_INT;                          /**< Channel Interrupt Status, offset: 0x644008 */
  __I  uint32_t CH30_SBR;                          /**< Channel System Bus, offset: 0x64400C */
  __IO uint32_t CH30_PRI;                          /**< Channel Priority, offset: 0x644010 */
  uint8_t RESERVED_90[4];
  __IO uint32_t CH30_MATTR;                        /**< Memory Attributes, offset: 0x644018 */
  uint8_t RESERVED_91[4];
  __IO uint32_t TCD30_SADDR;                       /**< TCD Source Address, offset: 0x644020 */
  __IO uint32_t TCD30_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x644024 */
  __IO uint16_t TCD30_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x644028 */
  __IO uint16_t TCD30_ATTR;                        /**< TCD Transfer Attributes, offset: 0x64402A */
  union {                                          /* offset: 0x64402C */
    __IO uint32_t TCD30_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x64402C */
    __IO uint32_t TCD30_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x64402C */
  } NBYTES30;
  __IO uint32_t TCD30_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x644030 */
  __IO uint32_t TCD30_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x644034 */
  __IO uint32_t TCD30_DADDR;                       /**< TCD Destination Address, offset: 0x644038 */
  __IO uint32_t TCD30_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x64403C */
  __IO uint32_t TCD30_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x644040 */
  __IO uint32_t TCD30_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x644044 */
  __IO uint16_t TCD30_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x644048 */
  union {                                          /* offset: 0x64404A */
    __IO uint16_t TCD30_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x64404A */
    __IO uint16_t TCD30_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x64404A */
  } CITER30;
  __IO uint16_t TCD30_CSR;                         /**< TCD Control and Status, offset: 0x64404C */
  union {                                          /* offset: 0x64404E */
    __IO uint16_t TCD30_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x64404E */
    __IO uint16_t TCD30_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x64404E */
  } BITER30;
  uint8_t RESERVED_92[8112];
  __IO uint32_t CH31_CSR;                          /**< Channel Control and Status, offset: 0x646000 */
  __IO uint32_t CH31_ES;                           /**< Channel Error Status, offset: 0x646004 */
  __IO uint32_t CH31_INT;                          /**< Channel Interrupt Status, offset: 0x646008 */
  __I  uint32_t CH31_SBR;                          /**< Channel System Bus, offset: 0x64600C */
  __IO uint32_t CH31_PRI;                          /**< Channel Priority, offset: 0x646010 */
  uint8_t RESERVED_93[4];
  __IO uint32_t CH31_MATTR;                        /**< Memory Attributes, offset: 0x646018 */
  uint8_t RESERVED_94[4];
  __IO uint32_t TCD31_SADDR;                       /**< TCD Source Address, offset: 0x646020 */
  __IO uint32_t TCD31_SADDR_HIGH;                  /**< TCD Source Address, offset: 0x646024 */
  __IO uint16_t TCD31_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x646028 */
  __IO uint16_t TCD31_ATTR;                        /**< TCD Transfer Attributes, offset: 0x64602A */
  union {                                          /* offset: 0x64602C */
    __IO uint32_t TCD31_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x64602C */
    __IO uint32_t TCD31_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x64602C */
  } NBYTES31;
  __IO uint32_t TCD31_SLAST_SDA;                   /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x646030 */
  __IO uint32_t TCD31_SLAST_SDA_HIGH;              /**< TCD Last Source Address Adjustment and Store DADDR Address, offset: 0x646034 */
  __IO uint32_t TCD31_DADDR;                       /**< TCD Destination Address, offset: 0x646038 */
  __IO uint32_t TCD31_DADDR_HIGH;                  /**< TCD Destination Address, offset: 0x64603C */
  __IO uint32_t TCD31_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x646040 */
  __IO uint32_t TCD31_DLAST_SGA_HIGH;              /**< TCD Last Destination Address Adjustment and Scatter/Gather Address, offset: 0x646044 */
  __IO uint16_t TCD31_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x646048 */
  union {                                          /* offset: 0x64604A */
    __IO uint16_t TCD31_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x64604A */
    __IO uint16_t TCD31_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x64604A */
  } CITER31;
  __IO uint16_t TCD31_CSR;                         /**< TCD Control and Status, offset: 0x64604C */
  union {                                          /* offset: 0x64604E */
    __IO uint16_t TCD31_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x64604E */
    __IO uint16_t TCD31_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x64604E */
  } BITER31;
} spp_dma5_TCD_Type, *spp_dma5_TCD_MemMapPtr;

