zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SPP_DMA5_TCD.h
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_NBYTES_MASK (0x3FFFFFFFU)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_NBYTES_SHIFT (0U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_NBYTES_WIDTH (30U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_NBYTES_SHIFT)) & spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_NBYTES_MASK)

#define spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_DMLOE_MASK (0x40000000U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_DMLOE_SHIFT (30U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_DMLOE_WIDTH (1U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_DMLOE_SHIFT)) & spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_DMLOE_MASK)

#define spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_SMLOE_MASK (0x80000000U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_SMLOE_SHIFT (31U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_SMLOE_WIDTH (1U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_SMLOE_SHIFT)) & spp_dma5_TCD_TCD8_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD8_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_NBYTES_MASK (0x3FFU)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_NBYTES_SHIFT (0U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_NBYTES_WIDTH (10U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_NBYTES_SHIFT)) & spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_NBYTES_MASK)

#define spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_MLOFF_MASK (0x3FFFFC00U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_MLOFF_SHIFT (10U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_MLOFF_WIDTH (20U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_MLOFF(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_MLOFF_SHIFT)) & spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_MLOFF_MASK)

#define spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_DMLOE_MASK (0x40000000U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_DMLOE_SHIFT (30U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_DMLOE_WIDTH (1U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_DMLOE_SHIFT)) & spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_DMLOE_MASK)

#define spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_SMLOE_MASK (0x80000000U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_SMLOE_SHIFT (31U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_SMLOE_WIDTH (1U)
#define spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_SMLOE_SHIFT)) & spp_dma5_TCD_TCD8_NBYTES_MLOFFYES_SMLOE_MASK)
/*! @} */

/*! @name TCD8_SLAST_SDA - TCD Last Source Address Adjustment and Store DADDR Address */
/*! @{ */

#define spp_dma5_TCD_TCD8_SLAST_SDA_SLAST_SDA_MASK (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD8_SLAST_SDA_SLAST_SDA_SHIFT (0U)
#define spp_dma5_TCD_TCD8_SLAST_SDA_SLAST_SDA_WIDTH (32U)
#define spp_dma5_TCD_TCD8_SLAST_SDA_SLAST_SDA(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD8_SLAST_SDA_SLAST_SDA_SHIFT)) & spp_dma5_TCD_TCD8_SLAST_SDA_SLAST_SDA_MASK)
/*! @} */

/*! @name TCD8_SLAST_SDA_HIGH - TCD Last Source Address Adjustment and Store DADDR Address */
/*! @{ */

#define spp_dma5_TCD_TCD8_SLAST_SDA_HIGH_SLAST_SDA_MASK (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD8_SLAST_SDA_HIGH_SLAST_SDA_SHIFT (0U)
#define spp_dma5_TCD_TCD8_SLAST_SDA_HIGH_SLAST_SDA_WIDTH (32U)
#define spp_dma5_TCD_TCD8_SLAST_SDA_HIGH_SLAST_SDA(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD8_SLAST_SDA_HIGH_SLAST_SDA_SHIFT)) & spp_dma5_TCD_TCD8_SLAST_SDA_HIGH_SLAST_SDA_MASK)
/*! @} */

/*! @name TCD8_DADDR - TCD Destination Address */
/*! @{ */

#define spp_dma5_TCD_TCD8_DADDR_DADDR_MASK       (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD8_DADDR_DADDR_SHIFT      (0U)
#define spp_dma5_TCD_TCD8_DADDR_DADDR_WIDTH      (32U)
#define spp_dma5_TCD_TCD8_DADDR_DADDR(x)         (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD8_DADDR_DADDR_SHIFT)) & spp_dma5_TCD_TCD8_DADDR_DADDR_MASK)
/*! @} */

/*! @name TCD8_DADDR_HIGH - TCD Destination Address */
/*! @{ */

#define spp_dma5_TCD_TCD8_DADDR_HIGH_DADDR_MASK  (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD8_DADDR_HIGH_DADDR_SHIFT (0U)
#define spp_dma5_TCD_TCD8_DADDR_HIGH_DADDR_WIDTH (32U)
#define spp_dma5_TCD_TCD8_DADDR_HIGH_DADDR(x)    (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD8_DADDR_HIGH_DADDR_SHIFT)) & spp_dma5_TCD_TCD8_DADDR_HIGH_DADDR_MASK)
/*! @} */

/*! @name TCD8_DLAST_SGA - TCD Last Destination Address Adjustment and Scatter/Gather Address */
/*! @{ */

#define spp_dma5_TCD_TCD8_DLAST_SGA_DLAST_SGA_MASK (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD8_DLAST_SGA_DLAST_SGA_SHIFT (0U)
#define spp_dma5_TCD_TCD8_DLAST_SGA_DLAST_SGA_WIDTH (32U)
#define spp_dma5_TCD_TCD8_DLAST_SGA_DLAST_SGA(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD8_DLAST_SGA_DLAST_SGA_SHIFT)) & spp_dma5_TCD_TCD8_DLAST_SGA_DLAST_SGA_MASK)
/*! @} */

/*! @name TCD8_DLAST_SGA_HIGH - TCD Last Destination Address Adjustment and Scatter/Gather Address */
/*! @{ */

#define spp_dma5_TCD_TCD8_DLAST_SGA_HIGH_DLAST_SGA_MASK (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD8_DLAST_SGA_HIGH_DLAST_SGA_SHIFT (0U)
#define spp_dma5_TCD_TCD8_DLAST_SGA_HIGH_DLAST_SGA_WIDTH (32U)
#define spp_dma5_TCD_TCD8_DLAST_SGA_HIGH_DLAST_SGA(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD8_DLAST_SGA_HIGH_DLAST_SGA_SHIFT)) & spp_dma5_TCD_TCD8_DLAST_SGA_HIGH_DLAST_SGA_MASK)
/*! @} */

/*! @name TCD8_DOFF - TCD Signed Destination Address Offset */
/*! @{ */

#define spp_dma5_TCD_TCD8_DOFF_DOFF_MASK         (0xFFFFU)
#define spp_dma5_TCD_TCD8_DOFF_DOFF_SHIFT        (0U)
#define spp_dma5_TCD_TCD8_DOFF_DOFF_WIDTH        (16U)
#define spp_dma5_TCD_TCD8_DOFF_DOFF(x)           (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD8_DOFF_DOFF_SHIFT)) & spp_dma5_TCD_TCD8_DOFF_DOFF_MASK)
/*! @} */

/*! @name TCD8_CITER_ELINKNO - TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define spp_dma5_TCD_TCD8_CITER_ELINKNO_CITER_MASK (0x7FFFU)
#define spp_dma5_TCD_TCD8_CITER_ELINKNO_CITER_SHIFT (0U)
#define spp_dma5_TCD_TCD8_CITER_ELINKNO_CITER_WIDTH (15U)
#define spp_dma5_TCD_TCD8_CITER_ELINKNO_CITER(x) (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD8_CITER_ELINKNO_CITER_SHIFT)) & spp_dma5_TCD_TCD8_CITER_ELINKNO_CITER_MASK)

#define spp_dma5_TCD_TCD8_CITER_ELINKNO_ELINK_MASK (0x8000U)
#define spp_dma5_TCD_TCD8_CITER_ELINKNO_ELINK_SHIFT (15U)
#define spp_dma5_TCD_TCD8_CITER_ELINKNO_ELINK_WIDTH (1U)
#define spp_dma5_TCD_TCD8_CITER_ELINKNO_ELINK(x) (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD8_CITER_ELINKNO_ELINK_SHIFT)) & spp_dma5_TCD_TCD8_CITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD8_CITER_ELINKYES - TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

