zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SPP_DMA5_TCD.h
/*! @name CH9_SBR - Channel System Bus */
/*! @{ */

#define spp_dma5_TCD_CH9_SBR_MID_MASK            (0x3FU)
#define spp_dma5_TCD_CH9_SBR_MID_SHIFT           (0U)
#define spp_dma5_TCD_CH9_SBR_MID_WIDTH           (6U)
#define spp_dma5_TCD_CH9_SBR_MID(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH9_SBR_MID_SHIFT)) & spp_dma5_TCD_CH9_SBR_MID_MASK)

#define spp_dma5_TCD_CH9_SBR_INSTR_MASK          (0x2000U)
#define spp_dma5_TCD_CH9_SBR_INSTR_SHIFT         (13U)
#define spp_dma5_TCD_CH9_SBR_INSTR_WIDTH         (1U)
#define spp_dma5_TCD_CH9_SBR_INSTR(x)            (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH9_SBR_INSTR_SHIFT)) & spp_dma5_TCD_CH9_SBR_INSTR_MASK)

#define spp_dma5_TCD_CH9_SBR_PAL_MASK            (0x8000U)
#define spp_dma5_TCD_CH9_SBR_PAL_SHIFT           (15U)
#define spp_dma5_TCD_CH9_SBR_PAL_WIDTH           (1U)
#define spp_dma5_TCD_CH9_SBR_PAL(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH9_SBR_PAL_SHIFT)) & spp_dma5_TCD_CH9_SBR_PAL_MASK)

#define spp_dma5_TCD_CH9_SBR_EMI_MASK            (0x10000U)
#define spp_dma5_TCD_CH9_SBR_EMI_SHIFT           (16U)
#define spp_dma5_TCD_CH9_SBR_EMI_WIDTH           (1U)
#define spp_dma5_TCD_CH9_SBR_EMI(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH9_SBR_EMI_SHIFT)) & spp_dma5_TCD_CH9_SBR_EMI_MASK)
/*! @} */

/*! @name CH9_PRI - Channel Priority */
/*! @{ */

#define spp_dma5_TCD_CH9_PRI_APL_MASK            (0x7U)
#define spp_dma5_TCD_CH9_PRI_APL_SHIFT           (0U)
#define spp_dma5_TCD_CH9_PRI_APL_WIDTH           (3U)
#define spp_dma5_TCD_CH9_PRI_APL(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH9_PRI_APL_SHIFT)) & spp_dma5_TCD_CH9_PRI_APL_MASK)

#define spp_dma5_TCD_CH9_PRI_DPA_MASK            (0x40000000U)
#define spp_dma5_TCD_CH9_PRI_DPA_SHIFT           (30U)
#define spp_dma5_TCD_CH9_PRI_DPA_WIDTH           (1U)
#define spp_dma5_TCD_CH9_PRI_DPA(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH9_PRI_DPA_SHIFT)) & spp_dma5_TCD_CH9_PRI_DPA_MASK)

#define spp_dma5_TCD_CH9_PRI_ECP_MASK            (0x80000000U)
#define spp_dma5_TCD_CH9_PRI_ECP_SHIFT           (31U)
#define spp_dma5_TCD_CH9_PRI_ECP_WIDTH           (1U)
#define spp_dma5_TCD_CH9_PRI_ECP(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH9_PRI_ECP_SHIFT)) & spp_dma5_TCD_CH9_PRI_ECP_MASK)
/*! @} */

/*! @name CH9_MATTR - Memory Attributes */
/*! @{ */

#define spp_dma5_TCD_CH9_MATTR_RCACHE_MASK       (0xFU)
#define spp_dma5_TCD_CH9_MATTR_RCACHE_SHIFT      (0U)
#define spp_dma5_TCD_CH9_MATTR_RCACHE_WIDTH      (4U)
#define spp_dma5_TCD_CH9_MATTR_RCACHE(x)         (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH9_MATTR_RCACHE_SHIFT)) & spp_dma5_TCD_CH9_MATTR_RCACHE_MASK)

#define spp_dma5_TCD_CH9_MATTR_WCACHE_MASK       (0xF0U)
#define spp_dma5_TCD_CH9_MATTR_WCACHE_SHIFT      (4U)
#define spp_dma5_TCD_CH9_MATTR_WCACHE_WIDTH      (4U)
#define spp_dma5_TCD_CH9_MATTR_WCACHE(x)         (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH9_MATTR_WCACHE_SHIFT)) & spp_dma5_TCD_CH9_MATTR_WCACHE_MASK)
/*! @} */

/*! @name TCD9_SADDR - TCD Source Address */
/*! @{ */

#define spp_dma5_TCD_TCD9_SADDR_SADDR_MASK       (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD9_SADDR_SADDR_SHIFT      (0U)
#define spp_dma5_TCD_TCD9_SADDR_SADDR_WIDTH      (32U)
#define spp_dma5_TCD_TCD9_SADDR_SADDR(x)         (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD9_SADDR_SADDR_SHIFT)) & spp_dma5_TCD_TCD9_SADDR_SADDR_MASK)
/*! @} */

/*! @name TCD9_SADDR_HIGH - TCD Source Address */
/*! @{ */

#define spp_dma5_TCD_TCD9_SADDR_HIGH_SADDR_MASK  (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD9_SADDR_HIGH_SADDR_SHIFT (0U)
#define spp_dma5_TCD_TCD9_SADDR_HIGH_SADDR_WIDTH (32U)
#define spp_dma5_TCD_TCD9_SADDR_HIGH_SADDR(x)    (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD9_SADDR_HIGH_SADDR_SHIFT)) & spp_dma5_TCD_TCD9_SADDR_HIGH_SADDR_MASK)
/*! @} */

/*! @name TCD9_SOFF - TCD Signed Source Address Offset */
/*! @{ */

#define spp_dma5_TCD_TCD9_SOFF_SOFF_MASK         (0xFFFFU)
#define spp_dma5_TCD_TCD9_SOFF_SOFF_SHIFT        (0U)
#define spp_dma5_TCD_TCD9_SOFF_SOFF_WIDTH        (16U)
#define spp_dma5_TCD_TCD9_SOFF_SOFF(x)           (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_SOFF_SOFF_SHIFT)) & spp_dma5_TCD_TCD9_SOFF_SOFF_MASK)
/*! @} */

/*! @name TCD9_ATTR - TCD Transfer Attributes */
/*! @{ */

#define spp_dma5_TCD_TCD9_ATTR_DSIZE_MASK        (0x7U)
#define spp_dma5_TCD_TCD9_ATTR_DSIZE_SHIFT       (0U)
#define spp_dma5_TCD_TCD9_ATTR_DSIZE_WIDTH       (3U)
#define spp_dma5_TCD_TCD9_ATTR_DSIZE(x)          (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_ATTR_DSIZE_SHIFT)) & spp_dma5_TCD_TCD9_ATTR_DSIZE_MASK)

#define spp_dma5_TCD_TCD9_ATTR_DMOD_MASK         (0xF8U)
#define spp_dma5_TCD_TCD9_ATTR_DMOD_SHIFT        (3U)
#define spp_dma5_TCD_TCD9_ATTR_DMOD_WIDTH        (5U)
#define spp_dma5_TCD_TCD9_ATTR_DMOD(x)           (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_ATTR_DMOD_SHIFT)) & spp_dma5_TCD_TCD9_ATTR_DMOD_MASK)

#define spp_dma5_TCD_TCD9_ATTR_SSIZE_MASK        (0x700U)
#define spp_dma5_TCD_TCD9_ATTR_SSIZE_SHIFT       (8U)
#define spp_dma5_TCD_TCD9_ATTR_SSIZE_WIDTH       (3U)
#define spp_dma5_TCD_TCD9_ATTR_SSIZE(x)          (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_ATTR_SSIZE_SHIFT)) & spp_dma5_TCD_TCD9_ATTR_SSIZE_MASK)

#define spp_dma5_TCD_TCD9_ATTR_SMOD_MASK         (0xF800U)
#define spp_dma5_TCD_TCD9_ATTR_SMOD_SHIFT        (11U)
#define spp_dma5_TCD_TCD9_ATTR_SMOD_WIDTH        (5U)
#define spp_dma5_TCD_TCD9_ATTR_SMOD(x)           (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_ATTR_SMOD_SHIFT)) & spp_dma5_TCD_TCD9_ATTR_SMOD_MASK)
/*! @} */

/*! @name TCD9_NBYTES_MLOFFNO - TCD Transfer Size Without Minor Loop Offsets */
/*! @{ */

#define spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_NBYTES_MASK (0x3FFFFFFFU)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_NBYTES_SHIFT (0U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_NBYTES_WIDTH (30U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_NBYTES_SHIFT)) & spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_NBYTES_MASK)

#define spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_DMLOE_MASK (0x40000000U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_DMLOE_SHIFT (30U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_DMLOE_WIDTH (1U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_DMLOE_SHIFT)) & spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_DMLOE_MASK)

#define spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_SMLOE_MASK (0x80000000U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_SMLOE_SHIFT (31U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_SMLOE_WIDTH (1U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_SMLOE_SHIFT)) & spp_dma5_TCD_TCD9_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD9_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

