zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SPP_DMA5_TCD.h
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_NBYTES_MASK (0x3FFU)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_NBYTES_SHIFT (0U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_NBYTES_WIDTH (10U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_NBYTES_SHIFT)) & spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_NBYTES_MASK)

#define spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_MLOFF_MASK (0x3FFFFC00U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_MLOFF_SHIFT (10U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_MLOFF_WIDTH (20U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_MLOFF(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_MLOFF_SHIFT)) & spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_MLOFF_MASK)

#define spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_DMLOE_MASK (0x40000000U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_DMLOE_SHIFT (30U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_DMLOE_WIDTH (1U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_DMLOE_SHIFT)) & spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_DMLOE_MASK)

#define spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_SMLOE_MASK (0x80000000U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_SMLOE_SHIFT (31U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_SMLOE_WIDTH (1U)
#define spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_SMLOE_SHIFT)) & spp_dma5_TCD_TCD9_NBYTES_MLOFFYES_SMLOE_MASK)
/*! @} */

/*! @name TCD9_SLAST_SDA - TCD Last Source Address Adjustment and Store DADDR Address */
/*! @{ */

#define spp_dma5_TCD_TCD9_SLAST_SDA_SLAST_SDA_MASK (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD9_SLAST_SDA_SLAST_SDA_SHIFT (0U)
#define spp_dma5_TCD_TCD9_SLAST_SDA_SLAST_SDA_WIDTH (32U)
#define spp_dma5_TCD_TCD9_SLAST_SDA_SLAST_SDA(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD9_SLAST_SDA_SLAST_SDA_SHIFT)) & spp_dma5_TCD_TCD9_SLAST_SDA_SLAST_SDA_MASK)
/*! @} */

/*! @name TCD9_SLAST_SDA_HIGH - TCD Last Source Address Adjustment and Store DADDR Address */
/*! @{ */

#define spp_dma5_TCD_TCD9_SLAST_SDA_HIGH_SLAST_SDA_MASK (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD9_SLAST_SDA_HIGH_SLAST_SDA_SHIFT (0U)
#define spp_dma5_TCD_TCD9_SLAST_SDA_HIGH_SLAST_SDA_WIDTH (32U)
#define spp_dma5_TCD_TCD9_SLAST_SDA_HIGH_SLAST_SDA(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD9_SLAST_SDA_HIGH_SLAST_SDA_SHIFT)) & spp_dma5_TCD_TCD9_SLAST_SDA_HIGH_SLAST_SDA_MASK)
/*! @} */

/*! @name TCD9_DADDR - TCD Destination Address */
/*! @{ */

#define spp_dma5_TCD_TCD9_DADDR_DADDR_MASK       (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD9_DADDR_DADDR_SHIFT      (0U)
#define spp_dma5_TCD_TCD9_DADDR_DADDR_WIDTH      (32U)
#define spp_dma5_TCD_TCD9_DADDR_DADDR(x)         (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD9_DADDR_DADDR_SHIFT)) & spp_dma5_TCD_TCD9_DADDR_DADDR_MASK)
/*! @} */

/*! @name TCD9_DADDR_HIGH - TCD Destination Address */
/*! @{ */

#define spp_dma5_TCD_TCD9_DADDR_HIGH_DADDR_MASK  (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD9_DADDR_HIGH_DADDR_SHIFT (0U)
#define spp_dma5_TCD_TCD9_DADDR_HIGH_DADDR_WIDTH (32U)
#define spp_dma5_TCD_TCD9_DADDR_HIGH_DADDR(x)    (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD9_DADDR_HIGH_DADDR_SHIFT)) & spp_dma5_TCD_TCD9_DADDR_HIGH_DADDR_MASK)
/*! @} */

/*! @name TCD9_DLAST_SGA - TCD Last Destination Address Adjustment and Scatter/Gather Address */
/*! @{ */

#define spp_dma5_TCD_TCD9_DLAST_SGA_DLAST_SGA_MASK (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD9_DLAST_SGA_DLAST_SGA_SHIFT (0U)
#define spp_dma5_TCD_TCD9_DLAST_SGA_DLAST_SGA_WIDTH (32U)
#define spp_dma5_TCD_TCD9_DLAST_SGA_DLAST_SGA(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD9_DLAST_SGA_DLAST_SGA_SHIFT)) & spp_dma5_TCD_TCD9_DLAST_SGA_DLAST_SGA_MASK)
/*! @} */

/*! @name TCD9_DLAST_SGA_HIGH - TCD Last Destination Address Adjustment and Scatter/Gather Address */
/*! @{ */

#define spp_dma5_TCD_TCD9_DLAST_SGA_HIGH_DLAST_SGA_MASK (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD9_DLAST_SGA_HIGH_DLAST_SGA_SHIFT (0U)
#define spp_dma5_TCD_TCD9_DLAST_SGA_HIGH_DLAST_SGA_WIDTH (32U)
#define spp_dma5_TCD_TCD9_DLAST_SGA_HIGH_DLAST_SGA(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD9_DLAST_SGA_HIGH_DLAST_SGA_SHIFT)) & spp_dma5_TCD_TCD9_DLAST_SGA_HIGH_DLAST_SGA_MASK)
/*! @} */

/*! @name TCD9_DOFF - TCD Signed Destination Address Offset */
/*! @{ */

#define spp_dma5_TCD_TCD9_DOFF_DOFF_MASK         (0xFFFFU)
#define spp_dma5_TCD_TCD9_DOFF_DOFF_SHIFT        (0U)
#define spp_dma5_TCD_TCD9_DOFF_DOFF_WIDTH        (16U)
#define spp_dma5_TCD_TCD9_DOFF_DOFF(x)           (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_DOFF_DOFF_SHIFT)) & spp_dma5_TCD_TCD9_DOFF_DOFF_MASK)
/*! @} */

/*! @name TCD9_CITER_ELINKNO - TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define spp_dma5_TCD_TCD9_CITER_ELINKNO_CITER_MASK (0x7FFFU)
#define spp_dma5_TCD_TCD9_CITER_ELINKNO_CITER_SHIFT (0U)
#define spp_dma5_TCD_TCD9_CITER_ELINKNO_CITER_WIDTH (15U)
#define spp_dma5_TCD_TCD9_CITER_ELINKNO_CITER(x) (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_CITER_ELINKNO_CITER_SHIFT)) & spp_dma5_TCD_TCD9_CITER_ELINKNO_CITER_MASK)

#define spp_dma5_TCD_TCD9_CITER_ELINKNO_ELINK_MASK (0x8000U)
#define spp_dma5_TCD_TCD9_CITER_ELINKNO_ELINK_SHIFT (15U)
#define spp_dma5_TCD_TCD9_CITER_ELINKNO_ELINK_WIDTH (1U)
#define spp_dma5_TCD_TCD9_CITER_ELINKNO_ELINK(x) (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_CITER_ELINKNO_ELINK_SHIFT)) & spp_dma5_TCD_TCD9_CITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD9_CITER_ELINKYES - TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define spp_dma5_TCD_TCD9_CITER_ELINKYES_CITER_MASK (0x1FFU)
#define spp_dma5_TCD_TCD9_CITER_ELINKYES_CITER_SHIFT (0U)
#define spp_dma5_TCD_TCD9_CITER_ELINKYES_CITER_WIDTH (9U)
#define spp_dma5_TCD_TCD9_CITER_ELINKYES_CITER(x) (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_CITER_ELINKYES_CITER_SHIFT)) & spp_dma5_TCD_TCD9_CITER_ELINKYES_CITER_MASK)

#define spp_dma5_TCD_TCD9_CITER_ELINKYES_LINKCH_MASK (0x3E00U)
#define spp_dma5_TCD_TCD9_CITER_ELINKYES_LINKCH_SHIFT (9U)
#define spp_dma5_TCD_TCD9_CITER_ELINKYES_LINKCH_WIDTH (5U)
#define spp_dma5_TCD_TCD9_CITER_ELINKYES_LINKCH(x) (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_CITER_ELINKYES_LINKCH_SHIFT)) & spp_dma5_TCD_TCD9_CITER_ELINKYES_LINKCH_MASK)

#define spp_dma5_TCD_TCD9_CITER_ELINKYES_ELINK_MASK (0x8000U)
#define spp_dma5_TCD_TCD9_CITER_ELINKYES_ELINK_SHIFT (15U)
#define spp_dma5_TCD_TCD9_CITER_ELINKYES_ELINK_WIDTH (1U)
#define spp_dma5_TCD_TCD9_CITER_ELINKYES_ELINK(x) (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_CITER_ELINKYES_ELINK_SHIFT)) & spp_dma5_TCD_TCD9_CITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name TCD9_CSR - TCD Control and Status */
/*! @{ */

#define spp_dma5_TCD_TCD9_CSR_START_MASK         (0x1U)
#define spp_dma5_TCD_TCD9_CSR_START_SHIFT        (0U)
#define spp_dma5_TCD_TCD9_CSR_START_WIDTH        (1U)
#define spp_dma5_TCD_TCD9_CSR_START(x)           (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_CSR_START_SHIFT)) & spp_dma5_TCD_TCD9_CSR_START_MASK)

#define spp_dma5_TCD_TCD9_CSR_INTMAJOR_MASK      (0x2U)
#define spp_dma5_TCD_TCD9_CSR_INTMAJOR_SHIFT     (1U)
#define spp_dma5_TCD_TCD9_CSR_INTMAJOR_WIDTH     (1U)
#define spp_dma5_TCD_TCD9_CSR_INTMAJOR(x)        (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_CSR_INTMAJOR_SHIFT)) & spp_dma5_TCD_TCD9_CSR_INTMAJOR_MASK)

#define spp_dma5_TCD_TCD9_CSR_INTHALF_MASK       (0x4U)
#define spp_dma5_TCD_TCD9_CSR_INTHALF_SHIFT      (2U)
#define spp_dma5_TCD_TCD9_CSR_INTHALF_WIDTH      (1U)
#define spp_dma5_TCD_TCD9_CSR_INTHALF(x)         (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_CSR_INTHALF_SHIFT)) & spp_dma5_TCD_TCD9_CSR_INTHALF_MASK)

#define spp_dma5_TCD_TCD9_CSR_DREQ_MASK          (0x8U)
#define spp_dma5_TCD_TCD9_CSR_DREQ_SHIFT         (3U)
#define spp_dma5_TCD_TCD9_CSR_DREQ_WIDTH         (1U)
#define spp_dma5_TCD_TCD9_CSR_DREQ(x)            (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_CSR_DREQ_SHIFT)) & spp_dma5_TCD_TCD9_CSR_DREQ_MASK)

#define spp_dma5_TCD_TCD9_CSR_ESG_MASK           (0x10U)
#define spp_dma5_TCD_TCD9_CSR_ESG_SHIFT          (4U)
#define spp_dma5_TCD_TCD9_CSR_ESG_WIDTH          (1U)
#define spp_dma5_TCD_TCD9_CSR_ESG(x)             (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_CSR_ESG_SHIFT)) & spp_dma5_TCD_TCD9_CSR_ESG_MASK)

#define spp_dma5_TCD_TCD9_CSR_MAJORELINK_MASK    (0x20U)
#define spp_dma5_TCD_TCD9_CSR_MAJORELINK_SHIFT   (5U)
#define spp_dma5_TCD_TCD9_CSR_MAJORELINK_WIDTH   (1U)
#define spp_dma5_TCD_TCD9_CSR_MAJORELINK(x)      (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_CSR_MAJORELINK_SHIFT)) & spp_dma5_TCD_TCD9_CSR_MAJORELINK_MASK)

#define spp_dma5_TCD_TCD9_CSR_ESDA_MASK          (0x80U)
#define spp_dma5_TCD_TCD9_CSR_ESDA_SHIFT         (7U)
#define spp_dma5_TCD_TCD9_CSR_ESDA_WIDTH         (1U)
#define spp_dma5_TCD_TCD9_CSR_ESDA(x)            (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_CSR_ESDA_SHIFT)) & spp_dma5_TCD_TCD9_CSR_ESDA_MASK)

#define spp_dma5_TCD_TCD9_CSR_MAJORLINKCH_MASK   (0x3F00U)
#define spp_dma5_TCD_TCD9_CSR_MAJORLINKCH_SHIFT  (8U)
#define spp_dma5_TCD_TCD9_CSR_MAJORLINKCH_WIDTH  (6U)
#define spp_dma5_TCD_TCD9_CSR_MAJORLINKCH(x)     (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_CSR_MAJORLINKCH_SHIFT)) & spp_dma5_TCD_TCD9_CSR_MAJORLINKCH_MASK)

#define spp_dma5_TCD_TCD9_CSR_TMC_MASK           (0xC000U)
#define spp_dma5_TCD_TCD9_CSR_TMC_SHIFT          (14U)
#define spp_dma5_TCD_TCD9_CSR_TMC_WIDTH          (2U)
#define spp_dma5_TCD_TCD9_CSR_TMC(x)             (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD9_CSR_TMC_SHIFT)) & spp_dma5_TCD_TCD9_CSR_TMC_MASK)
/*! @} */

/*! @name TCD9_BITER_ELINKNO - TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

