zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SPP_DMA5_TCD.h
/*! @name CH19_CSR - Channel Control and Status */
/*! @{ */

#define spp_dma5_TCD_CH19_CSR_ERQ_MASK           (0x1U)
#define spp_dma5_TCD_CH19_CSR_ERQ_SHIFT          (0U)
#define spp_dma5_TCD_CH19_CSR_ERQ_WIDTH          (1U)
#define spp_dma5_TCD_CH19_CSR_ERQ(x)             (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_CSR_ERQ_SHIFT)) & spp_dma5_TCD_CH19_CSR_ERQ_MASK)

#define spp_dma5_TCD_CH19_CSR_EARQ_MASK          (0x2U)
#define spp_dma5_TCD_CH19_CSR_EARQ_SHIFT         (1U)
#define spp_dma5_TCD_CH19_CSR_EARQ_WIDTH         (1U)
#define spp_dma5_TCD_CH19_CSR_EARQ(x)            (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_CSR_EARQ_SHIFT)) & spp_dma5_TCD_CH19_CSR_EARQ_MASK)

#define spp_dma5_TCD_CH19_CSR_EEI_MASK           (0x4U)
#define spp_dma5_TCD_CH19_CSR_EEI_SHIFT          (2U)
#define spp_dma5_TCD_CH19_CSR_EEI_WIDTH          (1U)
#define spp_dma5_TCD_CH19_CSR_EEI(x)             (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_CSR_EEI_SHIFT)) & spp_dma5_TCD_CH19_CSR_EEI_MASK)

#define spp_dma5_TCD_CH19_CSR_CX_MASK            (0x40U)
#define spp_dma5_TCD_CH19_CSR_CX_SHIFT           (6U)
#define spp_dma5_TCD_CH19_CSR_CX_WIDTH           (1U)
#define spp_dma5_TCD_CH19_CSR_CX(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_CSR_CX_SHIFT)) & spp_dma5_TCD_CH19_CSR_CX_MASK)

#define spp_dma5_TCD_CH19_CSR_ECX_MASK           (0x80U)
#define spp_dma5_TCD_CH19_CSR_ECX_SHIFT          (7U)
#define spp_dma5_TCD_CH19_CSR_ECX_WIDTH          (1U)
#define spp_dma5_TCD_CH19_CSR_ECX(x)             (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_CSR_ECX_SHIFT)) & spp_dma5_TCD_CH19_CSR_ECX_MASK)

#define spp_dma5_TCD_CH19_CSR_SWAP_MASK          (0xF000U)
#define spp_dma5_TCD_CH19_CSR_SWAP_SHIFT         (12U)
#define spp_dma5_TCD_CH19_CSR_SWAP_WIDTH         (4U)
#define spp_dma5_TCD_CH19_CSR_SWAP(x)            (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_CSR_SWAP_SHIFT)) & spp_dma5_TCD_CH19_CSR_SWAP_MASK)

#define spp_dma5_TCD_CH19_CSR_SIGNEXT_MASK       (0x3F0000U)
#define spp_dma5_TCD_CH19_CSR_SIGNEXT_SHIFT      (16U)
#define spp_dma5_TCD_CH19_CSR_SIGNEXT_WIDTH      (6U)
#define spp_dma5_TCD_CH19_CSR_SIGNEXT(x)         (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_CSR_SIGNEXT_SHIFT)) & spp_dma5_TCD_CH19_CSR_SIGNEXT_MASK)

#define spp_dma5_TCD_CH19_CSR_DONE_MASK          (0x40000000U)
#define spp_dma5_TCD_CH19_CSR_DONE_SHIFT         (30U)
#define spp_dma5_TCD_CH19_CSR_DONE_WIDTH         (1U)
#define spp_dma5_TCD_CH19_CSR_DONE(x)            (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_CSR_DONE_SHIFT)) & spp_dma5_TCD_CH19_CSR_DONE_MASK)

#define spp_dma5_TCD_CH19_CSR_ACTIVE_MASK        (0x80000000U)
#define spp_dma5_TCD_CH19_CSR_ACTIVE_SHIFT       (31U)
#define spp_dma5_TCD_CH19_CSR_ACTIVE_WIDTH       (1U)
#define spp_dma5_TCD_CH19_CSR_ACTIVE(x)          (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_CSR_ACTIVE_SHIFT)) & spp_dma5_TCD_CH19_CSR_ACTIVE_MASK)
/*! @} */

/*! @name CH19_ES - Channel Error Status */
/*! @{ */

#define spp_dma5_TCD_CH19_ES_DBE_MASK            (0x1U)
#define spp_dma5_TCD_CH19_ES_DBE_SHIFT           (0U)
#define spp_dma5_TCD_CH19_ES_DBE_WIDTH           (1U)
#define spp_dma5_TCD_CH19_ES_DBE(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_ES_DBE_SHIFT)) & spp_dma5_TCD_CH19_ES_DBE_MASK)

#define spp_dma5_TCD_CH19_ES_SBE_MASK            (0x2U)
#define spp_dma5_TCD_CH19_ES_SBE_SHIFT           (1U)
#define spp_dma5_TCD_CH19_ES_SBE_WIDTH           (1U)
#define spp_dma5_TCD_CH19_ES_SBE(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_ES_SBE_SHIFT)) & spp_dma5_TCD_CH19_ES_SBE_MASK)

#define spp_dma5_TCD_CH19_ES_SGE_MASK            (0x4U)
#define spp_dma5_TCD_CH19_ES_SGE_SHIFT           (2U)
#define spp_dma5_TCD_CH19_ES_SGE_WIDTH           (1U)
#define spp_dma5_TCD_CH19_ES_SGE(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_ES_SGE_SHIFT)) & spp_dma5_TCD_CH19_ES_SGE_MASK)

#define spp_dma5_TCD_CH19_ES_NCE_MASK            (0x8U)
#define spp_dma5_TCD_CH19_ES_NCE_SHIFT           (3U)
#define spp_dma5_TCD_CH19_ES_NCE_WIDTH           (1U)
#define spp_dma5_TCD_CH19_ES_NCE(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_ES_NCE_SHIFT)) & spp_dma5_TCD_CH19_ES_NCE_MASK)

#define spp_dma5_TCD_CH19_ES_DOE_MASK            (0x10U)
#define spp_dma5_TCD_CH19_ES_DOE_SHIFT           (4U)
#define spp_dma5_TCD_CH19_ES_DOE_WIDTH           (1U)
#define spp_dma5_TCD_CH19_ES_DOE(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_ES_DOE_SHIFT)) & spp_dma5_TCD_CH19_ES_DOE_MASK)

#define spp_dma5_TCD_CH19_ES_DAE_MASK            (0x20U)
#define spp_dma5_TCD_CH19_ES_DAE_SHIFT           (5U)
#define spp_dma5_TCD_CH19_ES_DAE_WIDTH           (1U)
#define spp_dma5_TCD_CH19_ES_DAE(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_ES_DAE_SHIFT)) & spp_dma5_TCD_CH19_ES_DAE_MASK)

#define spp_dma5_TCD_CH19_ES_SOE_MASK            (0x40U)
#define spp_dma5_TCD_CH19_ES_SOE_SHIFT           (6U)
#define spp_dma5_TCD_CH19_ES_SOE_WIDTH           (1U)
#define spp_dma5_TCD_CH19_ES_SOE(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_ES_SOE_SHIFT)) & spp_dma5_TCD_CH19_ES_SOE_MASK)

#define spp_dma5_TCD_CH19_ES_SAE_MASK            (0x80U)
#define spp_dma5_TCD_CH19_ES_SAE_SHIFT           (7U)
#define spp_dma5_TCD_CH19_ES_SAE_WIDTH           (1U)
#define spp_dma5_TCD_CH19_ES_SAE(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_ES_SAE_SHIFT)) & spp_dma5_TCD_CH19_ES_SAE_MASK)

#define spp_dma5_TCD_CH19_ES_ECX_MASK            (0x100U)
#define spp_dma5_TCD_CH19_ES_ECX_SHIFT           (8U)
#define spp_dma5_TCD_CH19_ES_ECX_WIDTH           (1U)
#define spp_dma5_TCD_CH19_ES_ECX(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_ES_ECX_SHIFT)) & spp_dma5_TCD_CH19_ES_ECX_MASK)

#define spp_dma5_TCD_CH19_ES_UCE_MASK            (0x200U)
#define spp_dma5_TCD_CH19_ES_UCE_SHIFT           (9U)
#define spp_dma5_TCD_CH19_ES_UCE_WIDTH           (1U)
#define spp_dma5_TCD_CH19_ES_UCE(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_ES_UCE_SHIFT)) & spp_dma5_TCD_CH19_ES_UCE_MASK)

#define spp_dma5_TCD_CH19_ES_ERR_MASK            (0x80000000U)
#define spp_dma5_TCD_CH19_ES_ERR_SHIFT           (31U)
#define spp_dma5_TCD_CH19_ES_ERR_WIDTH           (1U)
#define spp_dma5_TCD_CH19_ES_ERR(x)              (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_CH19_ES_ERR_SHIFT)) & spp_dma5_TCD_CH19_ES_ERR_MASK)
/*! @} */

/*! @name CH19_INT - Channel Interrupt Status */
/*! @{ */

