zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SPP_DMA5_TCD.h
#define spp_dma5_TCD_TCD20_SOFF_SOFF_MASK        (0xFFFFU)
#define spp_dma5_TCD_TCD20_SOFF_SOFF_SHIFT       (0U)
#define spp_dma5_TCD_TCD20_SOFF_SOFF_WIDTH       (16U)
#define spp_dma5_TCD_TCD20_SOFF_SOFF(x)          (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD20_SOFF_SOFF_SHIFT)) & spp_dma5_TCD_TCD20_SOFF_SOFF_MASK)
/*! @} */

/*! @name TCD20_ATTR - TCD Transfer Attributes */
/*! @{ */

#define spp_dma5_TCD_TCD20_ATTR_DSIZE_MASK       (0x7U)
#define spp_dma5_TCD_TCD20_ATTR_DSIZE_SHIFT      (0U)
#define spp_dma5_TCD_TCD20_ATTR_DSIZE_WIDTH      (3U)
#define spp_dma5_TCD_TCD20_ATTR_DSIZE(x)         (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD20_ATTR_DSIZE_SHIFT)) & spp_dma5_TCD_TCD20_ATTR_DSIZE_MASK)

#define spp_dma5_TCD_TCD20_ATTR_DMOD_MASK        (0xF8U)
#define spp_dma5_TCD_TCD20_ATTR_DMOD_SHIFT       (3U)
#define spp_dma5_TCD_TCD20_ATTR_DMOD_WIDTH       (5U)
#define spp_dma5_TCD_TCD20_ATTR_DMOD(x)          (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD20_ATTR_DMOD_SHIFT)) & spp_dma5_TCD_TCD20_ATTR_DMOD_MASK)

#define spp_dma5_TCD_TCD20_ATTR_SSIZE_MASK       (0x700U)
#define spp_dma5_TCD_TCD20_ATTR_SSIZE_SHIFT      (8U)
#define spp_dma5_TCD_TCD20_ATTR_SSIZE_WIDTH      (3U)
#define spp_dma5_TCD_TCD20_ATTR_SSIZE(x)         (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD20_ATTR_SSIZE_SHIFT)) & spp_dma5_TCD_TCD20_ATTR_SSIZE_MASK)

#define spp_dma5_TCD_TCD20_ATTR_SMOD_MASK        (0xF800U)
#define spp_dma5_TCD_TCD20_ATTR_SMOD_SHIFT       (11U)
#define spp_dma5_TCD_TCD20_ATTR_SMOD_WIDTH       (5U)
#define spp_dma5_TCD_TCD20_ATTR_SMOD(x)          (((uint16_t)(((uint16_t)(x)) << spp_dma5_TCD_TCD20_ATTR_SMOD_SHIFT)) & spp_dma5_TCD_TCD20_ATTR_SMOD_MASK)
/*! @} */

/*! @name TCD20_NBYTES_MLOFFNO - TCD Transfer Size Without Minor Loop Offsets */
/*! @{ */

#define spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_NBYTES_MASK (0x3FFFFFFFU)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_NBYTES_SHIFT (0U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_NBYTES_WIDTH (30U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_NBYTES_SHIFT)) & spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_NBYTES_MASK)

#define spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_DMLOE_MASK (0x40000000U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_DMLOE_SHIFT (30U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_DMLOE_WIDTH (1U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_DMLOE_SHIFT)) & spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_DMLOE_MASK)

#define spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_SMLOE_MASK (0x80000000U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_SMLOE_SHIFT (31U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_SMLOE_WIDTH (1U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_SMLOE_SHIFT)) & spp_dma5_TCD_TCD20_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD20_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_NBYTES_MASK (0x3FFU)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_NBYTES_SHIFT (0U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_NBYTES_WIDTH (10U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_NBYTES_SHIFT)) & spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_NBYTES_MASK)

#define spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_MLOFF_MASK (0x3FFFFC00U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_MLOFF_SHIFT (10U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_MLOFF_WIDTH (20U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_MLOFF(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_MLOFF_SHIFT)) & spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_MLOFF_MASK)

#define spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_DMLOE_MASK (0x40000000U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_DMLOE_SHIFT (30U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_DMLOE_WIDTH (1U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_DMLOE_SHIFT)) & spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_DMLOE_MASK)

#define spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_SMLOE_MASK (0x80000000U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_SMLOE_SHIFT (31U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_SMLOE_WIDTH (1U)
#define spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_SMLOE_SHIFT)) & spp_dma5_TCD_TCD20_NBYTES_MLOFFYES_SMLOE_MASK)
/*! @} */

/*! @name TCD20_SLAST_SDA - TCD Last Source Address Adjustment and Store DADDR Address */
/*! @{ */

#define spp_dma5_TCD_TCD20_SLAST_SDA_SLAST_SDA_MASK (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD20_SLAST_SDA_SLAST_SDA_SHIFT (0U)
#define spp_dma5_TCD_TCD20_SLAST_SDA_SLAST_SDA_WIDTH (32U)
#define spp_dma5_TCD_TCD20_SLAST_SDA_SLAST_SDA(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD20_SLAST_SDA_SLAST_SDA_SHIFT)) & spp_dma5_TCD_TCD20_SLAST_SDA_SLAST_SDA_MASK)
/*! @} */

/*! @name TCD20_SLAST_SDA_HIGH - TCD Last Source Address Adjustment and Store DADDR Address */
/*! @{ */

#define spp_dma5_TCD_TCD20_SLAST_SDA_HIGH_SLAST_SDA_MASK (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD20_SLAST_SDA_HIGH_SLAST_SDA_SHIFT (0U)
#define spp_dma5_TCD_TCD20_SLAST_SDA_HIGH_SLAST_SDA_WIDTH (32U)
#define spp_dma5_TCD_TCD20_SLAST_SDA_HIGH_SLAST_SDA(x) (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD20_SLAST_SDA_HIGH_SLAST_SDA_SHIFT)) & spp_dma5_TCD_TCD20_SLAST_SDA_HIGH_SLAST_SDA_MASK)
/*! @} */

/*! @name TCD20_DADDR - TCD Destination Address */
/*! @{ */

#define spp_dma5_TCD_TCD20_DADDR_DADDR_MASK      (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD20_DADDR_DADDR_SHIFT     (0U)
#define spp_dma5_TCD_TCD20_DADDR_DADDR_WIDTH     (32U)
#define spp_dma5_TCD_TCD20_DADDR_DADDR(x)        (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD20_DADDR_DADDR_SHIFT)) & spp_dma5_TCD_TCD20_DADDR_DADDR_MASK)
/*! @} */

/*! @name TCD20_DADDR_HIGH - TCD Destination Address */
/*! @{ */

#define spp_dma5_TCD_TCD20_DADDR_HIGH_DADDR_MASK (0xFFFFFFFFU)
#define spp_dma5_TCD_TCD20_DADDR_HIGH_DADDR_SHIFT (0U)
#define spp_dma5_TCD_TCD20_DADDR_HIGH_DADDR_WIDTH (32U)
#define spp_dma5_TCD_TCD20_DADDR_HIGH_DADDR(x)   (((uint32_t)(((uint32_t)(x)) << spp_dma5_TCD_TCD20_DADDR_HIGH_DADDR_SHIFT)) & spp_dma5_TCD_TCD20_DADDR_HIGH_DADDR_MASK)
/*! @} */

